[
  {
    "course_name": "IIMBx: Marketing Management",
    "institution": "Indian Institute of Management Bangalore",
    "course_description": "According to world-renowned management consultant, Peter Drucker, \"Marketing is the only distinguishing and unique function of business…There is only one valid definition of business purpose and that is to create a customer.”\nWhile the significance of marketing in today’s business world can never be overstated, it is the precise understanding and appreciation of marketing management that needs to be accentuated. Marketing management allows an organization to track, review and analyze their marketing resources and activities.\nIn this marketing course, you will learn the fundamentals of marketing management, as you gradually learn advanced theories and applications through real world business examples, illustrations, cases and exercises. You will learn how marketing management tools can be used to increase your customer base, improve customer satisfaction and increase your company’s overall perceived value.\nYou will learn how marketing serves as a key element within an organization’s strategy.",
    "level": "Intermediate",
    "duration": "9 weeks",
    "rating": "4.309091",
    "associated_skills": "Marketing, Customer Satisfaction, Management Consulting, Customer Service, Marketing Management, Marketing Mix",
    "grow_these_skills": "Basic concepts of marketing, Segmentation, targeting, differentiation and positioning, Marketing strategy, 4Ps of marketing: product, price, place and promotion",
    "prerequisites": "None",
    "language": "en",
    "about_this_course": "According to world-renowned management consultant, Peter Drucker, \"Marketing is the only distinguishing and unique function of business…There is only one valid definition of business purpose and that is to create a customer.”",
    "price": "$199.2"
  },
  {
    "course_name": "ImperialX: Coaching Skills for Learner-Centred Conversations",
    "institution": "Imperial College London",
    "course_description": "This interactive course will introduce you to coaching skills for learner-centred conversations. As well as learning about and practicing these skills, you will have the opportunity to reflect on how you can use and integrate these skills into your own educational contexts. The modules will cover:\n\nKey principles of coaching approaches in education\nCreating the conditions needed for an effective learning relationship\nApplying coaching approaches to conversations with learners\nUsing coaching approaches in feedback conversations",
    "level": "Beginner",
    "duration": "4 weeks",
    "rating": "4.55102",
    "associated_skills": "Life Coaching",
    "grow_these_skills": "To understand and apply the key principles of the coaching approach in education.",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "This interactive course will introduce you to coaching skills for learner-centred conversations. As well as learning about and practicing these skills, you will have the opportunity to reflect on how you can use and integrate these skills into your own educational contexts. The modules will cover:",
    "price": "$199.2"
  },
  {
    "course_name": "TUMx: Six Sigma Part 2: Analyze, Improve, Control",
    "institution": "Technische Universität München",
    "course_description": "Building on the concepts from the first course in the Six Sigma Program, Define and Measure, in this course, you will learn how to statistically analyze data with the Six Sigma methodology using inferential statistical techniques to determine confidence intervals and to test hypotheses based on sample data. You will also review cause and effect techniques for root cause analysis.\nYou will learn how to perform correlation and regression analyses in order to confirm the root cause and understand how to improve your process and plan designed experiments.\nYou will learn how to implement statistical process control using control charts and quality management tools, including the 8 Disciplines and the 5 Whys to reduce risk and manage process deviations.\nTo complement the lectures, learners are provided with interactive exercises, which allow learners to see the statistics \"in action.\" Learners then master statistical concepts by completing practice problems. These are then reinforced using interactive case studies, which illustrate the application of the statistics in quality improvement situations.\nUpon successful completion of this program, learners will earn the TUM Lean and Six Sigma Yellow Belt certification, confirming mastery of Lean Six Sigma fundamentals to a Green Belt level. The material is based on the American Society for Quality (www.asq.org) Body of Knowledge up to a Green Belt Level. The Professional Certificate is designed as preparation for a Lean Six Sigma Green Belt exam.",
    "level": "Beginner",
    "duration": "8 weeks",
    "rating": "4.75",
    "associated_skills": "Quality Improvement, Lean Six Sigma Green Belt, Six Sigma Methodology, Six Sigma Yellow Belt, Quality Management, Six Sigma Green Belt Certification, Design For Six Sigma, Statistical Process Controls, Lean Manufacturing, Eight Disciplines Problem Solving (8D), Statistics, Lean Six Sigma, Control Chart, Confidence Intervals",
    "grow_these_skills": "To identify process problems and perform a root cause analysis using cause and effect diagrams and regression analysis., To analyze data using inferential statistical techniques, including confidence intervals and hypothesis testing., To test and quantitatively assess the impact of different improvement options using the design of an experiment., To test for the significance of effects using an Analysis of Variance., To implement control mechanisms for long-term monitoring using control charts for both quantitative and qualitative measurements.",
    "prerequisites": "This course reviews basic statistics used in Six Sigma and quality management, applying them to quality problems and methods. Therefore, basic math skills are necessary.",
    "language": "en",
    "about_this_course": "Building on the concepts from the first course in the Six Sigma Program, Define and Measure, in this course, you will learn how to statistically analyze data with the Six Sigma methodology using inferential statistical techniques to determine confidence intervals and to test hypotheses based on sample data. You will also review cause and effect techniques for root cause analysis.",
    "price": "$199.2"
  },
  {
    "course_name": "PennX: The Science of Generosity: Do Good…Feel Good",
    "institution": "University of Pennsylvania",
    "course_description": "What does it mean to be generous? Can giving make you happier and healthier? In this course, we’ll hear from multiple experts and explore the many facets of generosity by looking closely at the meanings, traits, and motivations behind giving behaviors across communities and cultures. We’ll discuss how generosity contributes to our own happiness and well-being as well as the happiness and well-being of our loved ones, our local communities, and our global society.\nWe won’t just talk about generosity: you’ll be able to do good and feel good -- without spending lots of time or money. You’ll have multiple opportunities for both doing and feeling good throughout the course and you’ll create a giving plan that helps you continue your generous acts into the future.",
    "level": "Beginner",
    "duration": "4 weeks",
    "rating": "4.5",
    "associated_skills": "Not found",
    "grow_these_skills": "Not found",
    "prerequisites": "There are no prerequisites for this course.",
    "language": "en",
    "about_this_course": "What does it mean to be generous? Can giving make you happier and healthier? In this course, we’ll hear from multiple experts and explore the many facets of generosity by looking closely at the meanings, traits, and motivations behind giving behaviors across communities and cultures. We’ll discuss how generosity contributes to our own happiness and well-being as well as the happiness and well-being of our loved ones, our local communities, and our global society.",
    "price": "$199.2"
  },
  {
    "course_name": "HarvardX: Remote Work Revolution for Everyone",
    "institution": "Harvard University",
    "course_description": "How are you thriving or surviving in your remote work environment?\nRemote working has long been an option for many organizations and employees. However, with the COVID-19 pandemic, many more organizations were forced to rapidly shift to remote work. While there are many benefits of remote working, including reduced commute, greater employee flexibility, increased productivity, lower operational costs, and a larger pool of global job applicants, virtual work can introduce new challenges. Employees and companies alike have learned to temporarily survive in a remote work environment; but, remote work is here to stay and will likely be a permanent fixture that transforms many organizations in one form or another. Everyone will need to develop the skills, competencies, tools, and mindsets to thrive in the remote environment.\nRemote work affects an entire organization. For individual contributors, it means having to learn to collaborate effectively with colleagues you rarely see in person. For managers, it means knowing how to lead fully remote teams, developing ways to keep your teams motivated, connected, and productive. For leaders, shifting to remote-work solutions means rapidly advancing your digital footprint, using cloud storage, considering cybersecurity risks, and deploying new tools to increase productivity among your workforce.\nIn Remote Work Revolution for Everyone, you will learn to excel in the virtual-work landscape. Using the Harvard Business School case method of real-world examples, Professor Tsedal Neeley will not only provide actionable recommendations but also explain the theories and concepts behind them. You will learn how to build trust, increase productivity, use digital tools intelligently, and remain fully aligned with your remote team. By the end of the course, you will create actionable steps to “relaunch” your team—focusing on new ways to stay connected, be collaborative, and remain productive—while meeting your own personal and organizational goals.\nRemote Work Revolution for Everyone will teach you best practices for working remotely. This course is based on Professor Neeley’s book— The Remote Work Revolution: Succeeding from Anywhere. Praise for the book includes:\n\"Neeley draws on her nearly 2 decades of research to answer the critical questions regarding how we best build productive and enjoyable virtual routines into our post-COVID-19 professional lives. Few of us are going back to the way we worked. Read her book and begin to prepare for the other side of this pandemic now.\" - Larry Culp, CEO of GE\n\"I often talk about the importance of trust when it comes to work: the trust of your employees, and building trust with your customers. This book provides a blueprint for how to build and maintain that trust and connection in a digital environment.\" - Eric S. Yuan, Founder & CEO, Zoom",
    "level": "Beginner",
    "duration": "3 weeks",
    "rating": "4.675",
    "associated_skills": "Customer Relationship Building, Telecommuting",
    "grow_these_skills": "Understand the key elements of remote work and use your knowledge to successfully navigate the remote work environment, Develop strategies for yourself and your team, improving productivity, communication, and collaboration, Understand the types of trust required to be successful in remote working environments—and how to build it, Implement practices that will allow you to be an effective leader and successfully manage a remote team, Create a plan to relaunch your team into successful remotely working contributors",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "How are you thriving or surviving in your remote work environment?",
    "price": "$199.2"
  },
  {
    "course_name": "USMx, UMD: Creating Innovative Business Models",
    "institution": "University System of Maryland",
    "course_description": "This course was created to guide aspiring and active startup entrepreneurs and corporate innovators that feel...\n\nOverwhelmed by the tasks of creating a new venture\nFrustrated with finding the right team at the right time\nDisappointed by the widespread failure of bringing good ideas to market\n\nIt’s common to desire...\n\nInnovative approaches and tools to help create a startup company or corporate venture\nIntelligence on what customers really want, and are willing to pay for\nInsights on the big picture of crafting a startup company, and how the puzzle pieces fit together\n\nThis course will help you to...\n\nUnderstand the theory and practice of value creation\nDetermine how to build the right team for your startup company or corporate venture\nAvoid wasting time with startup ideas with limited commercial potential\nRaise the right financial capital at the right time for the right purpose By the end of this course, you will be positioned to...\nEffectively design value propositions that directly align with your target customers’ interests\nAssemble and lead an well-comprised team to produce results that create value for your customers\nPursue big ideas that really matter to customers\nCraft a financial model that minimizes risks and maximizing your success",
    "level": "Beginner",
    "duration": "4 weeks",
    "rating": "4.75",
    "associated_skills": "Financial Strategy, Marketing Strategies, Value Propositions, Innovation, Financial Modeling",
    "grow_these_skills": "Effectively design value propositions that directly align with your target customers’ interests;, Pursue big ideas that really matter to customers; and, Craft a financial model that minimizes risks and maximizing your success.",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "This course was created to guide aspiring and active startup entrepreneurs and corporate innovators that feel...",
    "price": "$199.2"
  },
  {
    "course_name": "SmithsonianX: Interdisciplinary Teaching with Museum Objects",
    "institution": "The Smithsonian Institution",
    "course_description": "Teachers, don't miss this special opportunity to learn with four Smithsonian museums from home! Register for this 14-week course and join an online community of educators for an immersive exploration of teaching with museum objects and works of art. Museum educators will explore connections among their collections and model teaching strategies that participants can implement with their students, whether online or in the classroom. Participants will discover how to teach with museum resources to engage students in deeper thinking and support content learning across disciplines. They'll learn to use the Smithsonian Learning Lab to curate digital resource collections, and share lesson ideas among a new network of colleagues.\nWhich Smithsonian Museums Will You Learn From?\n\n\nNational Museum of African American History and Culture\n\n\nNational Museum of American History\n\n\nNational Portrait Gallery\n\n\nSmithsonian American Art Museum\n\n\n\nWho Should Enroll?\nTeachers of all subjects and grades are welcome to register. The program content will be most readily applicable to humanities teachers.\nWhat is Required of Participants?\nThe course is self-paced, designed to be taken over the course of 14 weeks, with one to two hours of content assigned per week. Participants are expected to view all recorded video sessions and respond to reflection prompts using a discussion board. \nParticipants will also be expected to create a digital resource collection using the Smithsonian Learning Lab.",
    "level": "Beginner",
    "duration": "14 weeks",
    "rating": "4.230769",
    "associated_skills": "African-American History, Interdisciplinary Teaching",
    "grow_these_skills": "Gain expertise from educators from multiple Smithsonian museums through recorded video sessions, Reflect and share ideas with a community of educators via discussion forums, Explore inquiry-based strategies for integrating museum objects and works of art into your teaching, whether in the classroom or online",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "Teachers, don't miss this special opportunity to learn with four Smithsonian museums from home! Register for this 14-week course and join an online community of educators for an immersive exploration of teaching with museum objects and works of art. Museum educators will explore connections among their collections and model teaching strategies that participants can implement with their students, whether online or in the classroom. Participants will discover how to teach with museum resources to engage students in deeper thinking and support content learning across disciplines. They'll learn to use the Smithsonian Learning Lab to curate digital resource collections, and share lesson ideas among a new network of colleagues.",
    "price": "$199.2"
  },
  {
    "course_name": "HarvardX: CS50's Introduction to Computer Science",
    "institution": "Harvard University",
    "course_description": "This is CS50x , Harvard University's introduction to the intellectual enterprises of computer science and the art of programming for majors and non-majors alike, with or without prior programming experience. An entry-level course taught by David J. Malan, CS50x teaches students how to think algorithmically and solve problems efficiently. Topics include abstraction, algorithms, data structures, encapsulation, resource management, security, software engineering, and web development. Languages include C, Python, SQL, and JavaScript plus CSS and HTML. Problem sets inspired by real-world domains of biology, cryptography, finance, forensics, and gaming. The on-campus version of CS50x , CS50, is Harvard's largest course.\nStudents who earn a satisfactory score on 9 problem sets (i.e., programming assignments) and a final project are eligible for a certificate. This is a self-paced course–you may take CS50x on your own schedule.\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.",
    "level": "Beginner",
    "duration": "12 weeks",
    "rating": "Not found",
    "associated_skills": "HyperText Markup Language (HTML), Computer Science, JavaScript (Programming Language), Python (Programming Language), Security Software, SQL (Programming Language), C (Programming Language), Resource Management, Cryptography, Forensic Sciences, Algorithms, Cascading Style Sheets (CSS), Data Structures, Finance",
    "grow_these_skills": "A broad and robust understanding of computer science and programming, How to think algorithmically and solve programming problems efficiently, Concepts like abstraction, algorithms, data structures, encapsulation, resource management, security, software engineering, and web development, Familiarity in a number of languages, including C, Python, SQL, and JavaScript plus CSS and HTML, How to develop and present a final programming project to your peers",
    "prerequisites": "None.",
    "language": "en",
    "about_this_course": "This is CS50x , Harvard University's introduction to the intellectual enterprises of computer science and the art of programming for majors and non-majors alike, with or without prior programming experience. An entry-level course taught by David J. Malan, CS50x teaches students how to think algorithmically and solve problems efficiently. Topics include abstraction, algorithms, data structures, encapsulation, resource management, security, software engineering, and web development. Languages include C, Python, SQL, and JavaScript plus CSS and HTML. Problem sets inspired by real-world domains of biology, cryptography, finance, forensics, and gaming. The on-campus version of CS50x , CS50, is Harvard's largest course.",
    "price": "$199.2"
  },
  {
    "course_name": "BerkeleyX: The Science of Happiness",
    "institution": "University of California, Berkeley",
    "course_description": "\"A free eight-week Science of Happiness course that will offer practical, research-backed tips on living a happy and meaningful life.\" - The Huffington Post\nWe all want to be happy, and there are countless ideas about what happiness is and how we can get some. But not many of those ideas are based on science. That's where this course comes in.\n\"The Science of Happiness\" is the first MOOC to teach the ground-breaking science of positive psychology, which explores the roots of a happy and meaningful life. Students will engage with some of the most provocative and practical lessons from this science, discovering how cutting-edge research can be applied to their own lives. Created by UC Berkeley's Greater Good Science Center, the course will zero in on a fundamental finding from positive psychology: that happiness is inextricably linked to having strong social connections and contributing to something bigger than yourself--the greater good. Students will learn about the cross-disciplinary research supporting this view, spanning the fields of psychology, neuroscience, evolutionary biology, and beyond.\nWhat's more, \"The Science of Happiness\" offers students practical strategies for tapping into and nurturing their own happiness, including trying several research-backed activities that foster social and emotional well-being, and exploring how their own happiness changes along the way.\nThe course's co-instructors, Dacher Keltner and Emiliana Simon-Thomas, are not only leading authorities on positive psychology but also gifted teachers skilled at making science fun and personal. They'll be joined by world-renowned experts discussing themes like empathy, mindfulness, and gratitude--experts including Barbara Fredrickson, Paul Ekman, Sonja Lyubomirsky, and Jon Kabat-Zinn. Health professionals who register can earn continuing education units for their participation.\nConsider signing up for this course with a friend or group - tweet about your registration, share it on Facebook, and use the buddy system to stay on track. Join the conversation on The Greater Good Science Center Facebook page, or in the BerkeleyX: GG101x The Science of Happiness Facebook group.\nThis program is offered in collaboration with edX, which is an online program manager (OPM) company. The roles and responsibilities of the OPM partner in the offering of the program are to provide the learning platform for the delivery of academic content, technical support for said platform, marketing support for the courses and programs, and creation of any credentials earned by the learner. UC Berkeley and UC Berkeley faculty are responsible for the creation of accessible academic content, instruction, grading and assessment.",
    "level": "Beginner",
    "duration": "11 weeks",
    "rating": "4.653061",
    "associated_skills": "Psychology, Evolutionary Biology, Empathy",
    "grow_these_skills": "What happiness really means and why it matters to you, How to increase your own happiness and foster happiness in others, Why social connections, kindness, and community are key to happiness, Which mental habits are most conducive to happiness and how mindfulness can help",
    "prerequisites": "None.",
    "language": "en",
    "about_this_course": "\"A free eight-week Science of Happiness course that will offer practical, research-backed tips on living a happy and meaningful life.\" - The Huffington Post",
    "price": "$199.2"
  },
  {
    "course_name": "HarvardX: CS50's Introduction to Programming with Python",
    "institution": "Harvard University",
    "course_description": "An introduction to programming using a language called Python. Learn how to read and write code as well as how to test and \"debug\" it. Designed for students with or without prior programming experience who'd like to learn Python specifically. Learn about functions, arguments, and return values (oh my!); variables and types; conditionals and Boolean expressions; and loops. Learn how to handle exceptions, find and fix bugs, and write unit tests; use third-party libraries; validate and extract data with regular expressions; model real-world entities with classes, objects, methods, and properties; and read and write files. Hands-on opportunities for lots of practice. Exercises inspired by real-world programming problems. No software required except for a web browser, or you can write code on your own PC or Mac. \nWhereas CS50x itself focuses on computer science more generally as well as programming with C, Python, SQL, and JavaScript, this course, aka CS50P, is entirely focused on programming with Python. You can take CS50P before CS50x, during CS50x, or after CS50x. But for an introduction to computer science itself, you should still take CS50x!",
    "level": "Beginner",
    "duration": "10 weeks",
    "rating": "Not found",
    "associated_skills": "Computer Science, C (Programming Language), SQL (Programming Language), Debugging, Data Science, Boolean Expression, Regular Expressions, Web Browsers, Personal Computers, JavaScript (Programming Language), Python (Programming Language), Unit Testing, Web Development",
    "grow_these_skills": "Functions, Variables, Conditionals, Loops, Exceptions, Libraries, Unit Tests, File I/O, Regular Expressions, Object-Oriented Programming, Et Cetera",
    "prerequisites": "None",
    "language": "en",
    "about_this_course": "An introduction to programming using a language called Python. Learn how to read and write code as well as how to test and \"debug\" it. Designed for students with or without prior programming experience who'd like to learn Python specifically. Learn about functions, arguments, and return values (oh my!); variables and types; conditionals and Boolean expressions; and loops. Learn how to handle exceptions, find and fix bugs, and write unit tests; use third-party libraries; validate and extract data with regular expressions; model real-world entities with classes, objects, methods, and properties; and read and write files. Hands-on opportunities for lots of practice. Exercises inspired by real-world programming problems. No software required except for a web browser, or you can write code on your own PC or Mac.",
    "price": "$199.2"
  },
  {
    "course_name": "HarvardX: CS50's Web Programming with Python and JavaScript",
    "institution": "Harvard University",
    "course_description": "Topics include database design, scalability, security, and user experience. Through hands-on projects, you'll learn to write and use APIs, create interactive UIs, and leverage cloud services like GitHub and Heroku. By course's end, you'll emerge with knowledge and experience in principles, languages, and tools that empower you to design and deploy applications on the Internet.",
    "level": "Intermediate",
    "duration": "12 weeks",
    "rating": "Not found",
    "associated_skills": "Scalability, Cloud Services, React.js, Django (Web Framework), Application Deployment, JavaScript (Programming Language), Web Development, Database Design, Cloud Computing, Computer Science, Github, Application Programming Interface (API), SQL (Programming Language), Python (Programming Language)",
    "grow_these_skills": "HTML, CSS, Git, Python, Django, SQL, Models, and Migrations, JavaScript, User Interfaces, Testing, CI/CD, Scalability and Security",
    "prerequisites": "CS50 or prior programming experience in any language.",
    "language": "en",
    "about_this_course": "Topics include database design, scalability, security, and user experience. Through hands-on projects, you'll learn to write and use APIs, create interactive UIs, and leverage cloud services like GitHub and Heroku. By course's end, you'll emerge with knowledge and experience in principles, languages, and tools that empower you to design and deploy applications on the Internet.",
    "price": "$199.2"
  },
  {
    "course_name": "BerkeleyX: The Foundations of Happiness at Work",
    "institution": "University of California, Berkeley",
    "course_description": "This course explains what happiness at work looks like, why it matters, and how to cultivate it.\nIt begins by defining happiness and making the case that happiness at work improves the performance of individual employees and organizations as a whole, increasing innovation, productivity, engagement, retention, and the quality of their work. It then explores the key factors that empirical research has linked to workplace happiness, zeroing in on practices such as gratitude, developing a strong sense of purpose, and forming authentic, cooperative connections with others. The course will also highlight common barriers to workplace happiness, both at the individual and cultural level.\nFinally, the course presents a practical framework for workplace happiness and explores accessible techniques for: a) evaluating happiness in an organization, b) creating an effective strategy to increase workplace happiness, and c) implementing that strategy in your own work life, within your team, or across the culture of your organization, with special tips for workplace leaders.\nThe course instructors are expert faculty from UC Berkeley’s Greater Good Science Center, Dacher Keltner, Ph.D., and Emiliana Simon-Thomas, Ph.D., whose earlier edX course, The Science of Happiness, has been a global phenomenon, introducing a half million students worldwide to the research-based keys to a happy, meaningful life. In this course, they tailor their scientific insights to the needs of the modern workplace.",
    "level": "Beginner",
    "duration": "4 weeks",
    "rating": "4.481481",
    "associated_skills": "Innovation",
    "grow_these_skills": "The personal, social, and professional advantages of happiness at work, How to identify barriers and pitfalls to achieving happiness at work, Strategies for evaluating levels of happiness within an organization",
    "prerequisites": "Recommended but not required: GG101x: The Science of Happiness",
    "language": "en",
    "about_this_course": "This course explains what happiness at work looks like, why it matters, and how to cultivate it.",
    "price": "$199.2"
  },
  {
    "course_name": "BabsonX: Entrepreneurial Operations: Launching a Startup",
    "institution": "Babson College",
    "course_description": "This startup operations course will examine the real-world operational challenges and execution risks associated with getting a new venture started. We will consider start-up ventures in a variety of industries. The course will provide you with a set of steps, frameworks, and tools that can be used to understand the important considerations for building a startup operation from scratch. \nIn each module, the students will be exposed to a different operations-related concept. Lecture notes, readings, and case studies will explore the key operations topics that are important for start-ups. Topics include: \n\nThe role of Operations in Launching a New Venture\nDeveloping an Operations Mindset\nUsing the Value Chain Canvas to document your Startup Operations\nOperational Risks and Challenges in Launching a New Venture\nOperations Metrics for Managing New Venture Performance",
    "level": "Intermediate",
    "duration": "4 weeks",
    "rating": "4.625",
    "associated_skills": "Operations",
    "grow_these_skills": "The role of operations in launching a start-up, The potential operational risks associated with launching a start-up, How to successfully launcha startup",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "This startup operations course will examine the real-world operational challenges and execution risks associated with getting a new venture started. We will consider start-up ventures in a variety of industries. The course will provide you with a set of steps, frameworks, and tools that can be used to understand the important considerations for building a startup operation from scratch.",
    "price": "$199.2"
  },
  {
    "course_name": "ImperialBusinessX, ImperialX: Climate Change: Financial Risks and Opportunities",
    "institution": "Imperial College Business School",
    "course_description": "Do you want to know more about how a warming planet is changing the landscape for investing? Geared towards professionals working in financial markets, this course provides a solid introduction to the financial risks and opportunities arising from man-made climate change. \nOur aim is to help you answer a simple question: Does climate risk matter to investors? We do this by defining the financial risks related to climate change and follow with the investment policies and risk management strategies that are taking shape. This course is also a starting point for risk and strategy managers anticipating the impacts from the Financial Stability Board’s Task Force on Climate-Related Financial Disclosures (TCFD) asking firms to disclose the climate risks they face. In short, the course is a primer on how global capital markets are responding the world’s greatest environmental risk. \nParticipants will be exposed to the latest thinking from senior leaders in financial services and multinational firms. The course is led by business school faculty and The Centre for Climate Finance and Investment at Imperial College London; designed by investment practitioners for finance professionals and those aspiring to enter the field. \nClimate-KIC is supported by EIT, a body of the European Union.",
    "level": "Intermediate",
    "duration": "4 weeks",
    "rating": "4.086957",
    "associated_skills": "Financial Market, Investments, Financial Services, Risk Management, Finance, Capital Markets",
    "grow_these_skills": "How to define climate change risks into distinct categories, An introduction to climate change risk management, Concepts of physical risks (eg. stranded assets) and transition risks (eg. renewable energy technology developments), Emerging trends in the transition towards climate-resilient investing, Ways of thinking about potential winners and losers in a lower carbon economy, Sources of financing emerging within the private sector for new investments",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "Do you want to know more about how a warming planet is changing the landscape for investing? Geared towards professionals working in financial markets, this course provides a solid introduction to the financial risks and opportunities arising from man-made climate change.",
    "price": "$199.2"
  },
  {
    "course_name": "RITx: Storytelling in the Workplace",
    "institution": "Rochester Institute of Technology",
    "course_description": "When you think about the most influential figures in your organization, in your country, and in the world, one of the qualities they all likely have in common is that they are exceptional storytellers. Everyone tells stories—that’s how we build community and share ideas. However, we don’t always tell our story as effectively as we intend to.\nStories, or narratives, in the workplace may take the form of email communications, proposals, briefs, project or product kickoffs, and presentations.\nIn this course, part of the Communication Skills Professional Certificate program, you’ll learn about the structure of a narrative and how it varies depending upon the situation, the medium used, and the audience. In today’s world of abbreviated messaging through a variety of devices, the importance of crafting a cohesive, professional, and understandable message to achieve a desired outcome is more important than ever.\nYou will learn how to create written messaging tailored to a target audience and how to determine the specific medium through which it should be communicated.\nYou will also study best practices for writing in all forms of media common to today’s workplace, focusing specifically on:\n\nStructure\nPoint of view\nTone\nStyle\n\nYou will also study and analyze a variety of messages which use different writing styles directed toward specific target audiences.",
    "level": "Beginner",
    "duration": "3 weeks",
    "rating": "4.384615",
    "associated_skills": "Writing, Target Audience, Communications",
    "grow_these_skills": "Understand the elements of effective stories and how to use them in the workplace, How to tailor your messaging to a defined target audience, How various platforms convey messages differently in a professional setting",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "When you think about the most influential figures in your organization, in your country, and in the world, one of the qualities they all likely have in common is that they are exceptional storytellers. Everyone tells stories—that’s how we build community and share ideas. However, we don’t always tell our story as effectively as we intend to.",
    "price": "$199.2"
  },
  {
    "course_name": "HarvardX: CS50's Introduction to Artificial Intelligence with Python",
    "institution": "Harvard University",
    "course_description": "This course explores the concepts and algorithms at the foundation of modern artificial intelligence, diving into the ideas that give rise to technologies like game-playing engines, handwriting recognition, and machine translation. Through hands-on projects, students gain exposure to the theory behind graph search algorithms, classification, optimization, machine learning, large language models, and other topics in artificial intelligence as they incorporate them into their own Python programs. By course’s end, students emerge with experience in libraries for machine learning as well as knowledge of artificial intelligence principles that enable them to design intelligent systems of their own.",
    "level": "Beginner",
    "duration": "7 weeks",
    "rating": "Not found",
    "associated_skills": "Medical Diagnosis, Algorithms, Intelligent Systems, Mathematical Optimization, Artificial Intelligence, Python (Programming Language), Machine Translation, Computer Science, Proofreading, Handwriting Recognition",
    "grow_these_skills": "knowledge representation, logical inference, probability theory, Bayesian networks, Markov models, constraint satisfaction, neural networks, natural language processing",
    "prerequisites": "CS50 or prior programming experience in Python.",
    "language": "en",
    "about_this_course": "This course explores the concepts and algorithms at the foundation of modern artificial intelligence, diving into the ideas that give rise to technologies like game-playing engines, handwriting recognition, and machine translation. Through hands-on projects, students gain exposure to the theory behind graph search algorithms, classification, optimization, machine learning, large language models, and other topics in artificial intelligence as they incorporate them into their own Python programs. By course’s end, students emerge with experience in libraries for machine learning as well as knowledge of artificial intelligence principles that enable them to design intelligent systems of their own.",
    "price": "$199.2"
  },
  {
    "course_name": "UMD, USMx: Data Science and Agile Systems for Product Management",
    "institution": "The University of Maryland, College Park",
    "course_description": "Modern systems today must be designed for agility in order to outpace the competition. Concepts like Agile, DevOps, and Data Science were once considered only for the technology-based companies. Today that means every company. Because there is no greater currency than timely information for optimizing operations and meeting the needs of customers.\nModern product management requires that every development and operations value stream is identified and continuously improved. This means using Lean and DevOps principles to streamline handoffs and information flows across teams. It means reorienting towards self-service and automation wherever possible. And to avoid incrementalism, it means a robust Agile development process to keep innovations important and aggressive enough to make noticeable improvements in value delivery.\nAgile systems in a DevOps environment requires that products are built completely differently from a traditional designs. Modularity, open set architectures, and flexible data management paradigms are a starting point. The evolutionary nature of the product with so much change enables functionality, design, and technology to drive and influence each other simultaneously. And beneath it all is a data collection and feedback loop essential for anticipating and reacting to business needs both for operations and marketing.\nData science and analytics are the lifeblood of any product organization, and enable product managers to tackle risks early. Luckily, new technologies allow us to collect and integrate data without extreme upfront constraints and onerous controls. This means all data is fair game, and when tagged and stored properly, can be made available at nearly any scale for preparation, visualization, analysis, and modeling.\nWe’ll teach you the paradigms, processes, and introduce some key technologies that make the data-driven product organization the optimal competitor in the market.",
    "level": "Intermediate",
    "duration": "4 weeks",
    "rating": "4.777778",
    "associated_skills": "Automation, Operations, Data Collection, Data Management, Agile Methodology, Fault Tolerance, Design And Technology, Self Service Technologies, Product Management, Modularity, Influencing Skills, Data Science, DevOps",
    "grow_these_skills": "Designing and modeling for fast feedback and idea sharing, System optimization with open architectures, Validating functions and verifying performance, Leveraging and enabling the system designs, platforms, and ecosystems, Lean Startup and Product Innovation Analytics, Developing the data collection and preparation pipeline for products and services, Analyzing the performance and testing hypotheses for usability, fast-feedback, and growth, Customer experience (CX) validation and enhancement leveraging usability analytics",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "Modern systems today must be designed for agility in order to outpace the competition. Concepts like Agile, DevOps, and Data Science were once considered only for the technology-based companies. Today that means every company. Because there is no greater currency than timely information for optimizing operations and meeting the needs of customers.",
    "price": "$199.2"
  },
  {
    "course_name": "IBM: Analyzing Data with Excel",
    "institution": "IBM",
    "course_description": "Please Note: Learners who successfully complete this IBM course can earn a skill badge — a detailed, verifiable and digital credential that profiles the knowledge and skills you’ve acquired in this course. Enroll to learn more, complete the course and claim your badge!\nThis course provides students with the fundamental knowledge required to use Excel spreadsheets to perform basic data analysis.The course consists of several videos, demos, examples, and hands-on labs to help you learn, and ends with a final assignment project which will help you put what you have learned into practice.\nExcel is an important tool when working with data - whether it is for business, marketing, research, or data analysis purposes. This course is targeted at those people who have ambitions in Data Analytics or Data Scientist roles, as well as those who just have a need to use Excel to perform data analysis in their own company or environment.\nLearners will gain useful experience in the cleaning and wrangling of data using functions, and in analyzing data using methods such as sorting, filtering, and pivot tables. This course starts with an introduction to spreadsheet applications such as Microsoft Excel and Google Sheets and discusses importing data from multiple different formats. During this introduction you will learn to carry out some basic-level data wrangling and data cleaning tasks and then you will expand your knowledge of data analysis via the use of sorting, filtering, and pivot tables in a spreadsheet.\nThe emphasis is on applied learning and hands-on practice in this course, and with each hands-on lab, you will gain further experience in the manipulation and handling of data and start to understand the important role that spreadsheets can perform in a data analysis environment. The final assignment project will allow you to apply these newly acquired skills to analyze data in a business scenario. By the end of this course, you will have worked with several data sets and spreadsheets and demonstrated the basics of cleaning and analyzing data all without having to learn any code.\nThis course makes it simple to get started using Excel for data analysis, as it does not require any previous spreadsheet or code-writing experience. The course also does not require you to perform any software downloads or installations. All that is required is a device with a modern web browser, and the ability to use (or create) a Microsoft account to access Excel online at no-cost. Although the hands-on labs steps are specifically related to using ‘Excel for the web’, if you already have the full desktop version of Excel, you should be able to use that to follow along quite easily with the labs.",
    "level": "Beginner",
    "duration": "5 weeks",
    "rating": "4.440605",
    "associated_skills": "Web Browsers, Google Sheets, Data Analysis, Microsoft Excel, Data Wrangling, Spreadsheets, Pivot Tables And Charts, Data Cleansing, Data Science",
    "grow_these_skills": "Perform basic spreadsheet tasks, Explain the importance of data quality, Import file data into Excel, Filter and sort data, Clean and prepare data, Analyze data using an Excel spreadsheet",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "Please Note: Learners who successfully complete this IBM course can earn a skill badge — a detailed, verifiable and digital credential that profiles the knowledge and skills you’ve acquired in this course. Enroll to learn more, complete the course and claim your badge!",
    "price": "$199.2"
  },
  {
    "course_name": "edX: How to Learn Online",
    "institution": "edX",
    "course_description": "This course harnesses science-backed techniques applicable across different learning platforms, equipping you with the strategies you need to thrive as an online learner.\nIn this course, you will:\nReflect on your Identity as a Learner: Learn about the history and benefits of learning online and reflect on how embarking on this new journey of learning online fits into your broader narrative as a lifelong learner. \nDevelop Digital Literacy Skills: Acquire essential skills for navigating and utilizing online learning technologies effectively, including familiarity with Learning Management Systems and the unique features of the edX platform.\nEnhance Metacognitive Skills: Learn to develop awareness of your own learning behaviors and thought processes, a key aspect of successful online learning.\nApply Effective Study Strategies: Master a range of study strategies based on current research, covering awareness, balance, community engagement, and dedication to learning.\nLeverage Community Resources: Understand how to effectively utilize peer interactions and community resources to enhance your learning experience.\nImprove Time Management: Cultivate strong time management skills tailored for online learning, including techniques like the Pomodoro method and understanding your chronotype for optimal learning.",
    "level": "Beginner",
    "duration": "2 weeks",
    "rating": "4.077922",
    "associated_skills": "Not found",
    "grow_these_skills": "Not found",
    "prerequisites": "None",
    "language": "en",
    "about_this_course": "This course harnesses science-backed techniques applicable across different learning platforms, equipping you with the strategies you need to thrive as an online learner.",
    "price": "$199.2"
  },
  {
    "course_name": "HarvardX: Exercising Leadership: Foundational Principles",
    "institution": "Harvard University",
    "course_description": "The crises of our time generate enormous adaptive challenges for our families, organizations, communities, and societies. The need for leadership that can mobilize people to meet these challenges and improve life is critical.\nIn this introductory course, you will explore strategies for leading in a changing world where adaptive pressures will continue to challenge all of us. You will discover new ways to approach complex organizational systems and take thoughtful action on the work we all face ahead. Most importantly, you will reflect on how to move forward on the leadership challenges you care about most.",
    "level": "Beginner",
    "duration": "4 weeks",
    "rating": "4.651845",
    "associated_skills": "Leadership",
    "grow_these_skills": "How to identify and unbundle complex challenges, How to understand the role of formal and informal authority, How to identify the key perspectives of stakeholders, How to build and renew trust relationships, How to approach conflict, How to implement personal strategies for surviving and thriving amidst change",
    "prerequisites": "None",
    "language": "en",
    "about_this_course": "The crises of our time generate enormous adaptive challenges for our families, organizations, communities, and societies. The need for leadership that can mobilize people to meet these challenges and improve life is critical.",
    "price": "$199.2"
  },
  {
    "course_name": "ANUx: Greatest Unsolved Mysteries of the Universe",
    "institution": "Australian National University",
    "course_description": "Despite spectacular recent progress, there is still a lot we don't know about our universe. We don't know why the Big Bang happened. We don't know what most of the universe is made of. We don't know whether there is life in space. We don't know how planets form, how black holes get so big, or where the first stars have gone. This course will take you through nine of the greatest unsolved problems of modern astrophysics. We can't promise you the answers, but we will explain what we do and don't know, and give you an up-to-date understanding of current research. This course is designed for people who would like to get a deeper understanding of these mysteries than that offered by popular science articles and shows.\nThis is the first of four ANUx courses which together make up the Australian National University's first year astrophysics program. It is followed by courses on exoplanets, on the violent universe, and on cosmology. These courses compromise the Astrophysics XSeries. Learn more about the XSeries program and register for all the courses in the series today!\nNote that this course will be shutting down permanently on 2nd July 2025. Last day to enrol or upgrade is 31st December 2024.",
    "level": "Intermediate",
    "duration": "9 weeks",
    "rating": "4.935484",
    "associated_skills": "Astrophysics",
    "grow_these_skills": "An understanding of the biggest unsolved mysteries in modern astrophysics, An appreciation of why these problems are so difficult, How astrophysicists are attempting to answer them, and the clues that have been identified so far",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "Despite spectacular recent progress, there is still a lot we don't know about our universe. We don't know why the Big Bang happened. We don't know what most of the universe is made of. We don't know whether there is life in space. We don't know how planets form, how black holes get so big, or where the first stars have gone. This course will take you through nine of the greatest unsolved problems of modern astrophysics. We can't promise you the answers, but we will explain what we do and don't know, and give you an up-to-date understanding of current research. This course is designed for people who would like to get a deeper understanding of these mysteries than that offered by popular science articles and shows.",
    "price": "$199.2"
  },
  {
    "course_name": "IBM: Data Visualization and Building Dashboards with Excel and Cognos",
    "institution": "IBM",
    "course_description": "Please Note: Learners who successfully complete this IBM course can earn a skill badge — a detailed, verifiable and digital credential that profiles the knowledge and skills you’ve acquired in this course. Enroll to learn more, complete the course and claim your badge!\nThis course provides students with the basics required to create data visualizations and dashboards using both Microsoft Excel and IBM Cognos Analytics. You begin the process of telling a story about your data by creating several basic and advanced charts in Excel and learning how to add them to a digital dashboard. You then become familiar with IBM Cognos Analytics - a popular tool for data visualization and analytics – and learn how to use it to create interactive and informative dashboards. By completing this course, you will gain a basic understanding of using spreadsheets as a tool for data visualization. You will also gain the ability to create effective data visualizations, such as charts or graphs, and you will start to see how they can play a key role in the communication of your data analysis findings to interested parties. All of this can be accomplished without the need to write any code. By the end of this course you will be able to describe common dashboarding tools used by a data analyst, design and create a dashboard in a cloud platform, and begin to raise your level of confidence when creating intermediate level data visualizations.\nThe emphasis is on applied learning and hands-on practice in this course, and with each hands-on lab, you will gain further experience in the creation of basic and advanced charts and the creation of digital dashboards using both Excel and Cognos Analytics. The final assignment project will allow you to apply these newly acquired skills to create and use data visualizations and add them to a digital dashboard to fulfil a business scenario.\nThis course makes it simple to get started using Excel and Cognos Analytics to create data\nvisualizations and dashboards to help tell a story about your data, and it does not require any previous data analysis or computer science\nexperience. The course also does not require you to perform any software downloads or installations. All that is required is basic computer literacy, high-school level math, a device with a modern web browser, and the ability to use (or create) a Microsoft account to access Excel online at no-cost, and a basic understanding of Excel spreadsheets. Although the Excel hands-on labs steps are specifically related to using ‘Excel for the web’, if you already have the full desktop version of Excel, you should be able to use that to follow along quite easily with the labs.",
    "level": "Beginner",
    "duration": "4 weeks",
    "rating": "4.459184",
    "associated_skills": "Spreadsheets, Data Analysis, Data Visualization, Microsoft Excel",
    "grow_these_skills": "Describe the important role charts play in telling a data-driven story, Use Excel features to create charts and pivot charts, Create advanced charts and visualizations, Create a simple dashboard using an Excel spreadsheet, Create visualizations in Cognos Analytics, Build an interactive dashboard",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "Please Note: Learners who successfully complete this IBM course can earn a skill badge — a detailed, verifiable and digital credential that profiles the knowledge and skills you’ve acquired in this course. Enroll to learn more, complete the course and claim your badge!",
    "price": "$199.2"
  },
  {
    "course_name": "HarvardX: CS50's Introduction to Cybersecurity",
    "institution": "Harvard University",
    "course_description": "This is CS50's introduction to cybersecurity for technical and non-technical audiences alike. Learn how to protect your own data, devices, and systems from today's threats and how to recognize and evaluate tomorrow's as well, both at home and at work. Learn to view cybersecurity not in absolute terms but relative, a function of risks and rewards (for an adversary) and costs and benefits (for you). Learn to recognize cybersecurity as a trade-off with usability itself. Course presents both high-level and low-level examples of threats, providing students with all they need know technically to understand both. Assignments inspired by real-world events.",
    "level": "Beginner",
    "duration": "5 weeks",
    "rating": "Not found",
    "associated_skills": "Cyber Security, Usability",
    "grow_these_skills": "hacking, cracking, social engineering, phishing attacks, brute-force attacks, dictionary attacks, biometrics, multi-factor authentication, password managers, ethical hacking, (distributed) denial-of-service attacks, viruses, worms, botnets, SQL injection attacks, port-scanning, proxies, firewalls, automatic updates, buffer-overflow attacks, secure deletion, hashing, salting, secret-key, public-key encryption, digital signatures, full-disk encryption, ransomware, cookies, sessions, incognito mode, anonymization, de-identification, verification, operating systems, app stores",
    "prerequisites": "Not found",
    "language": "en",
    "about_this_course": "This is CS50's introduction to cybersecurity for technical and non-technical audiences alike. Learn how to protect your own data, devices, and systems from today's threats and how to recognize and evaluate tomorrow's as well, both at home and at work. Learn to view cybersecurity not in absolute terms but relative, a function of risks and rewards (for an adversary) and costs and benefits (for you). Learn to recognize cybersecurity as a trade-off with usability itself. Course presents both high-level and low-level examples of threats, providing students with all they need know technically to understand both. Assignments inspired by real-world events.",
    "price": "$199.2"
  },
  {
    "course_name": "W3Cx: Introduction to Web Accessibility",
    "institution": "The World Wide Web Consortium (W3C)",
    "course_description": "Accessibility is essential for individuals and organizations that want to create high-quality websites and apps – and not exclude people from using their products and services. This course gives you the foundation in accessibility you need to excel in digital professions. It is designed for:\n\ndevelopers\ndesigners\ncontent authors\nproject managers\npeople with disabilities\nand others\n\nOptional material help you learn more about the topics you are most interested in.\nIn this course, you will learn about the international standards for web accessibility from the W3C – including Web Content Accessibility Guidelines (WCAG) and WAI-ARIA for Accessible Rich Internet Applications – and first steps in applying them.\nYou will also learn the broad scope of web accessibility, how people with disabilities use different assistive technologies and adaptive strategies, the business benefits of web accessibility, and where to find W3C resources on implementing accessibility. \nThe course is structured so that you can focus on the topics that you are most interested in. Optional activities and additional materials provide more learning on specific topics. Learn more.\nDon’t miss this unique course from the W3C Web Accessibility Initiative (WAI) in cooperation with the United Nations Educational, Scientific and Cultural Organization (UNESCO) Institute for Information Technology in Education (IITE). It brings together international expert trainers from Deque, Infoaxia, Intopia, Knowbility, The Paciello Group, and Web Key IT, and implements the open curriculum developed by the W3C WAI Education and Outreach Working Group (EOWG).",
    "level": "Beginner",
    "duration": "4 weeks",
    "rating": "4.340909",
    "associated_skills": "Web Accessibility, Information Technology, Rich Internet Application, Web Accessibility Initiative, Assistive Technology, User Experience, Web Content Accessibility Guidelines, Cooperation",
    "grow_these_skills": "Not found",
    "prerequisites": "None",
    "language": "en",
    "about_this_course": "Accessibility is essential for individuals and organizations that want to create high-quality websites and apps – and not exclude people from using their products and services. This course gives you the foundation in accessibility you need to excel in digital professions. It is designed for:",
    "price": "$199.2"
  }
]