[
  {
    "URL": "https://www.udacity.com/course/data-scientist-nanodegree--nd025",
    "Course Name": "Data Scientist Nanodegree Program",
    "Description": "What if you could recommend the perfect movie, predict housing prices to guide smart investments, or anticipate healthcare outcomes like diabetes and breast cancer? These are just a few of the challenges Data Scientists tackle every day. Data science is the driving force behind solving complex problems across industries. It can help HR departments retain their employees, allow policymakers to predict economic outcomes, and even enable NASA scientists to monitor environmental changes. In this program, you’ll not only tackle these real-world applications but also gain the skills to envision new solutions yourself. You’ll build projects that directly mirror the work done by data scientists in the field, incorporating the latest AI tools in both your workflows and your deliverables.",
    "Level": "Advanced",
    "Prerequisites": "Github, Matrix operations, matplotlib, Linear regression, Pandas, Intermediate SQL, NumPy, Basic calculus",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Blog posts, Magic methods, Unit testing, Data storytelling, CRISP-DM, AI algorithms in Python, Github portfolios, Similarity Score, Principal component analysis, Dimensionality reduction, Types of recommenders, Recommendation engines, Cluster validation, K-means clustering, Recommender system limitations, Basic unsupervised learning, Feature visualization, Matrix factorization, Hierarchical clustering models, Latent variables, Actionable insight generation, Evaluating unsupervised learning models, Business metrics, PyTorch, Tokenization, Convolutional neural networks, NLP pipelines, Stemming, Machine learning pipeline creation, NLP models, Part of speech tagging, Model cross-validation, Support vector machines, Data pre-processing for ML, Lemmatization, Feature extraction, Image pre-processing, Hyperparameter tuning, Opencv, Computer vision fluency, Python virtual environments, Model deployment, Inheritance, Github actions, Object-oriented design patterns, Python package management, Web forms, Object-oriented Python, Python packaging, Python decorator functions, Linting, Python classes, Feature importance calculation, Model evaluation, Model bias analysis, Gradient descent, Random forest models, Tree-based models, scikit-learn, Neural network basics, Basic supervised machine learning",
    "Rating": 4.8
  },
  {
    "URL": "https://www.udacity.com/course/data-analyst-nanodegree--nd002",
    "Course Name": "Data Analyst Nanodegree Program",
    "Description": "Clean up messy data, uncover patterns and insights, and communicate your findings. You'll start with an introduction to data analysis tools, including Jupyter Notebook, NumPy, pandas, and Matplotlib. Using these tools, you will ask questions about data and answer them through data collection, exploration, wrangling, and visualization. This intermediate-level program includes real-world projects where you will choose your own datasets, research questions, and analysis approach. As you progress through the program, each course will repeat the data analysis process while introducing more advanced techniques, such as applying data imputation to fill in missing data and applying appropriate encodings when developing data visualizations.",
    "Level": "Intermediate",
    "Prerequisites": "File i/o, Inferential statistics, Basic Python, Elementary algebra, Basic SQL, Basic descriptive statistics",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Latent variables, Data visualization design, Data fluency, Exploratory data analysis, Professional presentations, Data limitations and biases, Data storytelling, Jupyter notebooks, Quantitative data visualization, Data cleaning, Data storage, Data Tidiness Assessment, Data gathering, Pandas, Data quality assessment, Data wrangling, File i/o, Basic data visualizations, Data analysis process, NumPy, Data manipulation",
    "Rating": 4.8
  },
  {
    "URL": "https://www.udacity.com/course/aws-cloud-architect-nanodegree--nd063",
    "Course Name": "AWS Cloud Architect Nanodegree Program",
    "Description": "Master the skills to design, deploy, and optimize cloud architectures using AWS. Learn to implement network connectivity strategies, manage multi-account environments with AWS Organizations and Control Tower, and optimize costs using tools like AWS Cost Explorer. Migrate and modernize data processing solutions by planning tailored migration strategies, optimizing analytics workloads, and enhancing scalability with AWS tools like Glue and Athena. Modernize legacy systems, design high-performance cloud solutions, and reduce costs by leveraging serverless and event-driven architectures, AWS Budgets, and CloudFormation. Through hands-on experience, gain real-world experience in architecting robust, scalable, and cost-efficient AWS infrastructures.",
    "Level": "Intermediate",
    "Prerequisites": "Application architecture, Linux, AWS cloudformation, Basic web development, DevOps, Object-oriented programming basics, Cloud development, AWS development, Cloud computing fundamentals, Command line interface basics",
    "Duration": "P1M",
    "Language": "en",
    "Skills": "Cloud architecture, Infrastructure as code, Cloud cost management, Serverless cloud computing architecture, Cloud architecture model types, Cloud migration strategy, Hybrid cloud workload deployment, Amazon Web Services, Cloud migration, AWS cost explorer, Amazon vpc",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/self-driving-car-engineer-nanodegree--nd0013",
    "Course Name": "Self Driving Car Engineer Nanodegree Program",
    "Description": "Work on the future of autonomous vehicles and help make the self-driving car revolution a reality!",
    "Level": "Advanced",
    "Prerequisites": "matplotlib, Basic calculus, Intermediate Python, Finding derivatives, C++ proficiency, Object-oriented Python, Linear algebra, Python data analysis libraries",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "Robot behavior planning, Object motion models, Robot motion planning, Eigen library, A* search algorithm, Robot trajectory generation, C++ syntax, Logistic regression, Model performance metrics, Camera calibration, Image transformations, Bayes' filter for localization, 1d object localization, Gradient descent, Bayes' theorem, Point clouds, Computer vision fluency, Feedforward neural networks, Waymo open dataset, Model evaluation, Automated path planning, Collision detection, 2d object localization, TensorFlow, Image classification, Backpropagation, Control algorithms, Object state estimation, Object perturbations, Iterative closest point, Law of total probability, Normal distributions transform, Lidar sensors, Point cloud library, Convolutional neural networks, AI business context, Tensorflow object detection API, Mpc controller, Vehicle action, Lidar, Linear regression, Tensors, Machine learning pipeline fundamentals, Cameras, Radar, Pid controller, Velocity profile generation, C++ control flow, Lidar visualization, Git, C++ classes, Lidar simulator, C++ functions, C++ standard library, Exploratory data analysis, Pillow, Object detection, Color models, Keras, Yolo algorithm, Deep learning, Overfitting prevention, Color spaces, Data augmentation, Computer vision image enhancement, Computer vision image filtering, Sensors, Bird's eye view maps, Sae j3016 levels of driving automation standard, Object tracking performance metrics, Waymo lidar specifications, Camera measurement models, Extended kalman filters, Lidar technical specifications, Object track score, Jacobians, Region-based convolutional neural networks, Computer vision benchmarks, Object tracking, Object track state, Root-mean-square error, Multi-target object tracking, Sensor visibility reasoning, Coordinate transformation, Range imaging, Lidar measurement models, Kalman filters, Feature extraction, Autonomous vehicle sensor selection",
    "Rating": 4.2
  },
  {
    "URL": "https://www.udacity.com/course/ai-for-trading--nd880",
    "Course Name": "AI for Trading Nanodegree Program",
    "Description": "Complete real-world projects designed by industry experts, covering topics from asset management to trading signal generation. Master AI algorithms for trading, and build your career-ready portfolio.",
    "Level": "Advanced",
    "Prerequisites": "Basic calculus, Linear algebra, Object-oriented Python",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "Pandas, Financial portfolio risk models, Financial trading, Word2vec, Feature engineering, Recurrent neural networks, Word embeddings, Financial portfolio optimization, Alpha research, NumPy, Anaconda, Jupyter notebooks, Python package management, matplotlib, AI algorithms in Python, Text generation, Data scraping, PyTorch, Gradient descent, Text pre-processing, Decision trees, Random forest models, NLP for finance, Financial portfolio theory, Tf-idf, Data ingestion, Overfitting prevention, Glove, Feature importance calculation, Sentiment analysis, Backtesting, NLP pipelines, Sequential data analysis, Bag of words, Investment performance attribution, Training neural networks, Backpropagation, Model performance metrics, Quant workflow, Cvxpy, Alpha signals, Financial indices, Time-series analysis with ML, Alpha generation, Particle filters, Volatility clustering, Arma, Kalman filters, Factor investing, Stock return factor models, Adjusting for corporate actions, Outlier analysis, Data pre-processing, Return calculation, Arima, Garch models, Etfs, Statistical regression",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/data-engineer-nanodegree--nd027",
    "Course Name": "Data Engineering with AWS Nanodegree Program",
    "Description": "Learn to design data models, build data warehouses and data lakes, automate data pipelines, and work with massive datasets.",
    "Level": "Intermediate",
    "Prerequisites": "Relational data models, Command line interface basics, Intermediate Python, Relational database basics, Basic github, Intermediate SQL, Amazon web services basics",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Database fundamentals, Cassandradb, PostgreSQL, Database normalization, Denormalized data schemas, Data modeling basics, Apache Airflow, Data pipeline dags, Data pipeline partitioning, Amazon s3, Data pipeline maintenance, Redshift, Data pipeline creation, Data lineage, AWS data lakes, ELT, Big data fluency, Data wrangling, Amazon Athena, Data Lakehouse Architecture, Apache Spark, Data format fundamentals, AWS glue, Data lakes, Data transformation, Data extraction, Infrastructure as code, Olap cubes, Table design, Cloud computing fluency, ETL, AWS storage services, Table partitioning, Online transaction processing, AWS data warehouse, Data warehouse architecture, Star schemas",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/aws-machine-learning-engineer-nanodegree--nd189",
    "Course Name": "AWS Machine Learning Engineer Nanodegree Nanodegree Program",
    "Description": "Develop the skills to build and deploy machine learning models in production environments using Amazon SageMaker. Understand the foundations of data science and machine learning as you explore Amazon SageMaker's latest features for model design and deployment. Engage in hands-on projects and case studies that mirror real-world scenarios, applying best practices to create scalable, production-ready machine learning solutions. Enhance your expertise in areas such as data preprocessing, model training, and deployment pipelines. Learn to leverage Amazon SageMaker's capabilities, including its integrated development environment, automated model tuning, and deployment services. This program is designed to advance your career by providing practical experience in deploying ML models at scale.",
    "Level": "Intermediate",
    "Prerequisites": "AWS familiarity, Intermediate Python, API proficiency, Jupyter notebooks, Deep learning, Basic Python, Basic probability",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "Neural network basics, Deep learning fluency, Sagemaker jumpstart, Machine learning framework fundamentals, Hyperparameter tuning, Feature engineering, Machine learning fluency, Cloud resource allocation, AWS lambda, Distributed model training with sagemaker, Sagemaker training jobs, Transformer neural networks, Sagemaker debugger, Image classification, Training neural networks, Deep learning model optimization, Transfer learning, PyTorch, Model deployment with sagemaker, Convolutional neural networks, Text classification, Model performance metrics, AI business context, Machine learning use cases, Data loading with sagemaker, Amazon elastic compute cloud, Vpc, Sagemaker feature store, Cloud security in AWS, Cloud cost management, Sagemaker logs, Cloud performance management, AWS storage services, Training data manifest files, Sagemaker autoscaling, Sagemaker processing, Sagemaker batch transform jobs, Sagemaker clarify, Machine learning pipeline creation, Sagemaker pipelines, Model monitoring, Sagemaker model endpoints, AWS step functions, Sagemaker model monitor, Amazon s3, Model training, Linear models, Xgboost, Autogluon, Pandas, Sagemaker studio notebooks, Tree-based models, Sagemaker ground truth, Machine learning lifecycle, Dataset annotation, Machine learning dataset fundamentals, scikit-learn, Automated machine learning, Sagemaker data wrangler",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/ux-designer-nanodegree--nd578",
    "Course Name": "User Experience Nanodegree Program",
    "Description": "The UX Fundamentals & Design Research program teaches the core principles of human-centered design, including scoping a design problem, conducting in-depth interviews, creating quantitative surveys, using research data to uncover opportunities, and applying psychology to design sketches with the end user in mind. Participants will learn how to develop a discussion guide, recruit research participants, and synthesize findings in the form of a research report. They will also learn how to translate research findings into low-fidelity prototypes that can be tested with users, design high-fidelity prototypes, and conduct usability tests. Finally, the program teaches advanced user interface principles to build interactive designs that engage users and improve key performance indicators.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Remote user testing, High fidelity prototypes, Design optimization, Visual style guides, Ui design, Product KPIs, Design systems, Accessible user experience design, Ui kits and plugins, Production-ready assets, Figma, Design annotation, User stories, Minimal viable products, Guerilla design sprints, User-friendly visual design, Product prototyping, Feature prioritization, Low fidelity prototypes, Feedback loops, Usability testing, Ideation, Double diamond design model, Iterative product design, Clickable prototypes, Qualitative data analysis, How might we method, Customer journey maps, Stakeholder management",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/full-stack-web-developer-nanodegree--nd0044",
    "Course Name": "Full Stack Web Developer Nanodegree Program",
    "Description": "Learn how to create server-side, data-driven web applications that support any front-end and can scale to support hundreds of thousands of users.",
    "Level": "Intermediate",
    "Prerequisites": "Command line interface basics, Basic computer programming, Relational database basics, Basic SQL, Identity and access management fundamentals, Basic web development, REST APIs, Basic Python",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "SQLAlchemy, Flask, HTTP, Docker, Application authentication, Application security basics, Application authorization, Cors, API fluency, Object-relational mapping, Relational database transactions, Parsing form data, Kubernetes, Git, Jwts, Auth0, API testing, Unittest, PostgreSQL, Relational database migration, Psycopg2, Containerization fluency, Continuous deployment, AWS cli, Container orchestration, AWS codepipeline, Amazon Elastic Kubernetes Service, Continuous integration, AWS codebuild, Database query sanitization, Role-based access control, Data security fundamentals, Salt, Code reviews, Postman, Data encryption, Integration testing, API development, Curl, API documentation, Model-view-controller, Tcp/ip, Client-server model, Crud model, Alembic, Application routing",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/c-plus-plus-nanodegree--nd213",
    "Course Name": "C++  Nanodegree Program",
    "Description": "Learn C++, a high-performance programming language used in the world's most exciting engineering jobs -- from self-driving cars and robotics to web browsers, media platforms, servers, and video games.",
    "Level": "Intermediate",
    "Prerequisites": "Intermediate computer programming",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Threading, Concurrent computing, Computer memory architecture, Dynamic memory allocation, C++ copy and move semantics, Heap memory, C++ polymorphism, A* search algorithm, Control flow, C++ syntax, C++ data structures, Futures and promises, Parallel computing, Data races, Message queues, Memory management in c++, R-values, Smart pointers, Buffer overruns, Memory-efficient programming, Call-by-value, Rule of three, Memory leaks, L-values, Code debugging, Segmentation fault, Automatic memory allocation, Hexadecimal numbers, Variable scope, Call-by-reference, Rule of five, Memory fragmentation, Virtual memory, Stack memory, Ownership in memory management, Uninitialized memory bugs, Call stacks, Raii, Encapsulation, Access specifiers, Inheritance, Abstraction, Generic programming, C++ data types, C++ file handling, C++ constants, Software project organization, C++ user input, C++ header files, Cmake, C++ pointers",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-programming-nanodegree--nd000",
    "Course Name": "Introduction to Programming Nanodegree Program",
    "Description": "Welcome to the world of programming! Learn the skills that all programmers use, whether they build apps, web pages, or analyze data.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P5M",
    "Language": "en",
    "Skills": "Control flow in Python, Command line interface basics, Python functions, Object-oriented Python, CSS, HTML, Python data structures, Text processing in Python, Code debugging, Python operators, Python classes, API requests, Variable scope, Python syntax, User input handling, Front-end development basics, Python methods, JSON, Python exception handling, Python lists, Computer memory architecture, Python standard library, Coding best practices, Python data types, Linting, Python scripting, Pep8, Code refactoring, Bash, Shell scripting, Built-in Python functions, Python turtle, Python function definition, Commenting code, Python variables, Devtools, Flexbox, Basic Python",
    "Rating": 4.8
  },
  {
    "URL": "https://www.udacity.com/course/introduction-to-sql--cd0021",
    "Course Name": "Introduction to SQL Course",
    "Description": "SQL is one of the most versatile tools available for extracting insights from stored data.\nLearn how to execute core SQL commands to define, select, manipulate, control access, aggregate, and join data and data tables. Understand when and how to use subqueries, several window functions, and partitions to complete complex tasks. Clean data, optimize SQL queries and write select advanced JOINs to enhance analysis performance, explain which cases you would want to use particular SQL commands, and apply the results from queries to address business problems. \n",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P4W",
    "Language": "en",
    "Skills": "SQL subqueries, SQL joins, SQL aggregations, SQL window functions, SQL queries, Data cleaning, SQL query performance tuning",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-self-driving-cars--nd113",
    "Course Name": "Introduction to Self-Driving Cars Nanodegree Program",
    "Description": "Learn the essentials of building a self-driving car, including probability, C++, machine learning, and linear algebra.",
    "Level": "Intermediate",
    "Prerequisites": "Basic C++, Elementary algebra, Basic calculus, Intermediate Python, Deep learning, Linear algebra",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Probability distribution, Python syntax, Object localization, Matrix operations, C++ code optimization, Computer vision fluency, Image transformations, Derivatives, C++ syntax, Basic probability, Binary classification models, Feature detection, Pythagorean theorem, Python data structures, Bayes' theorem, Feature extraction, Image classification, C++ libraries, Kalman filters, Image pre-processing, Machine learning fluency, Robot navigation, Integrals, Accelerometers, Robot state management, Object-oriented programming basics, Python arrays, Gaussian distribution, Data augmentation, Data pre-processing for ML, Graph algorithms, Search algorithms, Computer memory architecture, Memory management in c++, C++ functions, Programming language implementations, C++ classes, Programming language type systems, C++ control flow, Python classes, Conditional probability, Sine, Odometers, Cosine, Algorithmic problem solving, Uniform cost search, Greedy algorithms, Breadth-first search, Search problems, Python collections, Depth-first search, A* search algorithm, Tree search, Python lists, C++ vectors, Vectors, Python methods, Object motion models, Matrix multiplication, State transformations, Python functions, matplotlib, NumPy, Bayesian probability, Histogram filters, Code debugging",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/generative-ai--nd608",
    "Course Name": "Generative AI Nanodegree Program",
    "Description": "Embark on a transformative journey into Generative AI!  We'll start by diving into the essentials with an introductory course, progress to mastering text generation with Large Language Models, unravel the complexities of image creation in computer vision and cap it off by bringing AI to life in real-world applications. From foundational theories to building sophisticated chatbots and AI agents, this program will empower you with job-ready skills in the exciting field of Generative AI.",
    "Level": "Intermediate",
    "Prerequisites": "Database fundamentals, Intermediate Python",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Vectors, Retrieval-Augmented Generation, OpenAI API, LangChain, Image pre-processing, Transfer learning, Word embeddings, Ethical AI, Diffusion Models, Yolo algorithm, Model evaluation, Text generation, Computer vision fluency, Image classification, Large Language Models, Pandas, Image generation, Training neural networks, Convolutional neural networks, Parameter-Efficient Fine-Tuning, Image segmentation, Computer Vision Transformers, Tokenization, Data quality assessment, Generative adversarial networks, Together AI API, Search implementation in Python, NLP transformers, GPT, Selenium, Data cleaning, Natural language processing, Bert, Transformer neural networks, Prompt Engineering, PyTorch, Cosine, API requests, Recurrent neural networks, Attention mechanisms, Beautifulsoup, Data scraping, Generative AI Fluency, Hugging Face, Deep learning, Foundation Models",
    "Rating": 5
  },
  {
    "URL": "https://www.udacity.com/course/front-end-web-developer-nanodegree--nd0011",
    "Course Name": "Front End Web Developer Nanodegree Program",
    "Description": "Become a Front-End Web Developer by completing a variety of projects for your portfolio - become an HTML, CSS and JavaScript pro!",
    "Level": "Intermediate",
    "Prerequisites": "Basic web development, Basic JavaScript",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "CSS, Flexbox, Dom events, Website performance optimization, DOM manipulation, The document object model, Code debugging, HTML, Responsive web design, Control flow in JavaScript, The JavaScript call stack, JavaScript syntax, JavaScript variables, Ides, Website layout, JavaScript package management, Eslint, Webpack, Prettier, Jest, Java modules, Integration testing, Unit testing, HTML and CSS",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/deep-learning-nanodegree--nd101",
    "Course Name": "Deep Learning Nanodegree Program",
    "Description": "Build foundational skills in deep learning by designing and training neural networks to solve complex real-world problems. You’ll begin with the essentials of neural networks, advancing to specialized architectures like Convolutional and Recurrent Neural Networks, along with Generative Adversarial Networks. Through projects, create models for applications such as image classification, sentiment analysis, and face generation, gaining hands-on experience with PyTorch and advanced training techniques. Ideal for those aiming to harness the potential of deep learning, this experience prepares you to tackle AI challenges across various domains.",
    "Level": "Intermediate",
    "Prerequisites": "Python proficiency, Pandas, Matrix multiplication, Intermediate Python, Linear algebra, Fully convolutional neural networks, Basic calculus, NumPy, matplotlib, Deep learning fluency, Basic probability, Variational autoencoders, Feedforward neural networks, Jupyter notebooks, Neural network basics",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Generative adversarial networks, Model evaluation, Deep learning techniques, Markov games, Deep learning model optimization, Hyperparameter tuning, Cyclegan, Image generation, Training neural networks, Backpropagation, NLP transformers, Gpt3, Recurrent neural networks, Bert, Long-short term memory networks, Neural networks, Word2vec, Image pre-processing, Image segmentation, Neural network initialization, Bounding boxes, Semantic image segmentation, Convolutional kernels, U-net, Convolutional neural networks, Autoencoders, Image classification, Transfer learning, Model training, Object detection, PyTorch, Model performance metrics, Perceptron, Deep learning, Gradient descent, Overfitting prevention, scikit-learn, Advanced probability, Deep learning tools",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/computer-vision-nanodegree--nd891",
    "Course Name": "Computer Vision Nanodegree Program",
    "Description": "Master the computer vision skills behind advances in robotics and automation. Write programs to analyze images, implement feature extraction, and recognize objects using deep learning models.",
    "Level": "Advanced",
    "Prerequisites": "Object-oriented programming basics, Object-oriented Python, Intermediate Python, Basic arithmetic, Basic probability, Deep learning framework proficiency",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Object tracking, Slam, Recurrent neural networks, Object detection, Object localization, Attention mechanisms, Feature matching, Long-short term memory networks, Yolo algorithm, Model training, Convolutional neural networks, Neural network memory, Image caption generation, PyTorch, Image classification, Data augmentation, K-means clustering, Feature visualization, Convolutional kernels, Object recognition, Hough transforms, Neural network basics, Feature embeddings, 2d image transforms, Facial recognition, Neural network activation, Feature detection",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/natural-language-processing-nanodegree--nd892",
    "Course Name": "Natural Language Processing Nanodegree Program",
    "Description": "Master the skills to get computers to understand, process, and manipulate human language. Build models on real data, and get hands-on experience with sentiment analysis, machine translation, and more.",
    "Level": "Advanced",
    "Prerequisites": "Intermediate Python, Neural network basics, Basic probability, Object-oriented programming basics, Deep learning framework proficiency",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Machine translation, Alexa skill creation, Attention mechanisms, Fasttext, Speech recognition, Voice user interfaces, Alexa skill deployment, Feature extraction, Information extraction, Information retrieval, Text summarization, Image caption generation, Word2vec, NLP models, Question answering systems, Glove",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/cloud-developer-nanodegree--nd9990",
    "Course Name": "Cloud Developer Nanodegree Program",
    "Description": "Elevate your tech skills with our innovative program focused on Cloud Computing, Microservices, and Serverless Technologies. Master the fundamentals of AWS, learn to build and deploy scalable, full-stack applications on the cloud, and grasp the principles of modern cloud architecture. Delve into microservices, understanding architecture patterns, service replication, and independent scaling. Harness the power of serverless technologies, creating REST APIs and implementing security best practices. Our hands-on exercises offer practical experience, equipping you to design, build, and deploy complex applications. Stay ahead in the digital era with our comprehensive tech program.",
    "Level": "Intermediate",
    "Prerequisites": "HTML, Command line interface basics, Basic web development, Basic react, Basic JavaScript, NodeJS, Linux command line interface, Intermediate JavaScript, Object-oriented programming basics, HTML and CSS",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Kubernetes, Microservices architecture design, Microservices debugging, CI/CD, Cloud observability, Docker, Amazon Elastic Kubernetes Service, Travis ci, AWS lambda, AWS cloudformation, Auth0, Application authentication, AWS secrets manager, Serverless cloud computing architecture, Event-driven architecture, Jwts, Amazon DynamoDB, REST APIs, Serverless development, Amazon s3, Integration testing, AWS elastic beanstalk, Git, Cloud security in AWS, Amazon rds, Coding best practices, Unit testing, Cloud computing fluency, Cloud autoscaling, Vpc, Cloud load balancing, Amazon elastic compute cloud, Identity and access management fundamentals, Amazon simple notification service, Amazon vpc, AWS IAM, Amazon web services basics, AWS cli, Iam policies, Computer networking basics, Cloud deployment models, Iam users",
    "Rating": 4.4
  },
  {
    "URL": "https://www.udacity.com/course/flying-car-nanodegree--nd787",
    "Course Name": "Flying Car and Autonomous Flight Engineer Nanodegree Program",
    "Description": "Master autonomous flight software engineering skills as you learn about drone robotics, develop sophisticated flying car systems, and write real code for real aircraft.",
    "Level": "Advanced",
    "Prerequisites": "Intermediate computer programming, Basic calculus, Basic physics, Linear algebra",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "3d robot motion control, Quadrotor dynamics, Basic probability, Pid controller, Extended kalman filters, Object state estimation, Graph theory, Automated path planning, 2d robot motion control, Quadrotor hardware components, Kalman filters, Control systems, Euler angles, Unscented kalman filters, Sensor calibration, 1d robot motion control, Statistical sampling, Accelerometers, Dead reckoning, Feature tracking, Particle filters, Optical flow in computer vision, Sensors, Gps, Sensor fusion, Mathematical optimization, Quadrotor control systems, Least squares, Drone flight control, Gyroscopes, Robot representation, Graph algorithms, Robot motion planning, Rotation matrices, Search algorithms, Barometers, Magnetometers, Imus, Object state estimation without gps, Jacobians, Bayes' filter for localization, Monte carlo methods, Bayes' theorem, A* search algorithm, Jupyter notebooks, 2d search space representation, Ray tracing, 3d search space representation, Quaternions, Bresenham's line algorithm, Random sampling, Automated planning heuristics, Event-driven programming, Px4 autopilot, Qgroundcontrol",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/digital-marketing-nanodegree--nd018",
    "Course Name": "Digital Marketing Nanodegree Program",
    "Description": "Gain real-world experience running live campaigns as you learn from experts. Launch your career with a 360-degree understanding of digital marketing.",
    "Level": "Beginner",
    "Prerequisites": "Acquisition funnels, User personas",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Social media advertising, Content calendars, Social media marketing platforms, Social media content, Digital marketing campaign evaluation, Target personas, Social media marketing, Social media campaign objectives, Facebook ads, Social media marketing metrics, Social media community management, Leveraging social media influencers, Marketing objectives, Marketing channels, Marketing fundamentals, Customer journey maps, Value proposition, Marketing metrics, Empathy maps, Email contact forms, Email marketing metrics, Email marketing content, Mailchimp, A/B testing, Google ads, Native advertising, Ad campaign management, Audience targeting, Programmatic display advertising, Display advertising, Video advertising, Search text ads, Cost per click, Search engine ad ranking, Keyword lists, Dynamic search ads, Digital marketing metrics, Search engine optimization, SEO audits, Link building, Utm codes, Audience evaluation, MarTech fluency, Google analytics fundamentals, Marketing KPIs, Conversion tracking, Agile marketing, Competitive analysis, Branding strategy, Content marketing strategy",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/business-analytics-nanodegree--nd098",
    "Course Name": "Business Analytics Nanodegree Program",
    "Description": "Master essential data analysis skills to drive informed business decisions across industries. This program covers data fundamentals, teaching you to collect, analyze, and visualize data using Excel, SQL, and Tableau. Learn to work with spreadsheets, perform statistical analysis, create financial models, and build interactive dashboards. Apply your skills to real-world projects, such as analyzing NYSE S&P financial data and optimizing business practices using a digital music store database. Gain proficiency in data-driven decision-making, financial forecasting, and creating impactful visualizations. This program is designed for aspiring business analysts and professionals seeking to enhance their data analysis and interpretation capabilities in a business context.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Basic spreadsheet use, Business KPIs, SQL aggregations, SQL joins, Basic descriptive statistics, Spreadsheet functions, Quantitative data visualization, Forecast modeling in spreadsheets, SQL queries, SQL subqueries, SQL window functions, Data visualization in spreadsheets, Professional presentations, Finance metrics, Marketing metrics, Data validation in spreadsheets, Pivot tables, Categorical data visualization, Inferential statistics, Chart types, Sales metrics, Growth metrics, Tableau interactive dashboards, Tableau calculated fields, Tableau map-based visualizations, Data visualization design, Tableau storypoint, Tableau data pane, Tableau field organization and customization, Chart selection, Data storytelling, Tableau visualizations",
    "Rating": 4.8
  },
  {
    "URL": "https://www.udacity.com/course/data-structures-and-algorithms-nanodegree--nd256",
    "Course Name": "Data Structures and Algorithms Nanodegree Program",
    "Description": "Get hands-on practice with over 100 data structures and  algorithm exercises and guidance from a dedicated mentor to help prepare you for interviews and on-the-job scenarios.",
    "Level": "Intermediate",
    "Prerequisites": "Basic Python, Elementary algebra",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Basic algorithms, Tree search, Sorting algorithms, Basic Python, Graph algorithms, Depth-first search, Graph data structure, A* search algorithm, Breadth-first search, Greedy algorithms, Dynamic programming, Divide and conquer algorithms, Tree algorithms, Data structures, Recursive algorithms, Python trees, Python arrays, Hash maps",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/programming-for-data-science-nanodegree--nd104",
    "Course Name": "Programming for Data Science with Python Nanodegree Program",
    "Description": "Learn programming skills needed to uncover patterns and insights in large data sets, running queries with relational databases and working with Unix shell and Git.",
    "Level": "Beginner",
    "Prerequisites": "Basic spreadsheet use, Basic descriptive statistics",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Git, NumPy, Pandas, SQL aggregations, SQL joins, SQL queries, Control flow, Python scripting, Built-in Python functions, Python methods, Python function definition, SQL subqueries, SQL window functions, Unix shell, Python package management, Python data types, Iterators, Python exception handling, Python best practices, Python operators, Python data structures, Docstrings, Anaconda, Python ides, Variable scope, List comprehension, Python syntax, User input handling, Data storytelling, Tableau data pane, Tableau map-based visualizations, Tableau interactive dashboards, Tableau field organization and customization, Data visualization design, Tableau visualizations, Chart selection, Tableau storypoint, Tableau calculated fields",
    "Rating": 4.8
  },
  {
    "URL": "https://www.udacity.com/course/react-nanodegree--nd019",
    "Course Name": "React Nanodegree Program",
    "Description": "React is completely transforming the Front-End Development landscape. Come master this powerful UI library, and learn career-ready skills with Udacity. You'll learn how to build declarative user interfaces for the web with React, and for iOS and Android with React Native. You'll also learn how to manage state more predictably in your applications with Redux.",
    "Level": "Intermediate",
    "Prerequisites": "Intermediate JavaScript, Asynchronous JavaScript, Basic web development",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "React component state, React router, Application state management with redux, React design patterns, Jest, React-redux bindings, Fetching data, React hooks, JavaScript functions, Basic react, Create react app, Software testing, Application architecture, Automation testing, Redux middleware, Integration testing, Behavioral software testing, Redux-thunk, Functional testing, Web forms, Asynchronous redux, Futures and promises, Data lifecycle management, Test-driven development, Application development best practices, Unit testing, JavaScript composition, Jsx",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/ai-artificial-intelligence-nanodegree--nd898",
    "Course Name": "Artificial Intelligence Nanodegree Program",
    "Description": "Master the foundations of artificial intelligence by exploring essential AI techniques, including search algorithms, symbolic logic, and planning systems. This program guides you through building intelligent agents that can strategize, optimize, and make decisions independently. Engage in hands-on projects where you’ll construct algorithms for problem-solving and automated planning used in robotics and complex logistical systems. You’ll learn to design AI solutions using proven methods, from iterative optimization techniques to advanced search methods, preparing you to solve real-world challenges.",
    "Level": "Advanced",
    "Prerequisites": "Object-oriented Python, Intermediate Python, Object-oriented programming basics, Basic data structures and algorithms, Basic descriptive statistics, Basic calculus, Command line interface basics, Differential calculus, Scripting, Linear algebra, Basic algorithms, Jupyter notebooks",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Optimization algorithms, Likelihood function, Minimax search, Bayesian networks, First order logic, Constraint propagation, Constraint satisfaction problems, Part of speech tagging, Basic probability, Ibm watson, Viterbi algorithm, Hidden markov models, Text pre-processing, Baum-welch algorithm, Time-series analysis with ML, State space search, Multi-agent training, Simulated annealing, A* search algorithm, Uninformed search, Search algorithms, Hill climbing, Search implementation in Python, Informed search, Automated planning problem definition, Propositional logic, Planning algorithms, Automated planning heuristics, Planning graphs, Backtracking search, AI algorithms in Python, Uniform cost search, Algorithmic problem solving, Breadth-first search, Heuristic evaluations, Depth-first search",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/ios-developer-nanodegree--nd003",
    "Course Name": " iOS Development with SwiftUI and SwiftData Nanodegree Program",
    "Description": "Master writing in Swift as you build five portfolio-worthy iOS apps to demonstrate your expertise as an iOS Developer. \n\nSystem Requirements: This program requires a MacOS computer with Ventura 13.5 or higher.",
    "Level": "Intermediate",
    "Prerequisites": "Ios, Xcode ide, Basic swift, Basic computer programming, Swift",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "iOS Development, HTTP, Credential management, Application authentication, Network requests in swift, Authentication, Swift data persistence, Swift classes, Application state management, Data modeling basics, Data binding, Mobile data management, iOS Core Data, iOS View Hierarchy, iOS Tab Navigation, iOS Animations, Xcode ide basics, iOS Stack Navigation, iOS UI Development, Uiviews, iOS Affordances, iOS SplitView Navigation, iOS Gestures, Ui design, Swift closures, Swift sets, Control flow, Swift Generics, Swift enums, Swift functions, Swift properties, Basic swift, Swift class extensions, Swift data types, Swift inheritance, Swift structs, String manipulation in swift, Swift operators, Swift arrays, Swift methods, Swift Tuples, Swift protocols, Boolean expressions, Swift Error Handling, Swift constants, Swift dictionaries, Swift optionals, Swift collections, Swift syntax, Swift grand central dispatch, Swift file management, Swift NSUserDefaults, Avfoundation framework, Code debugging, Swift and objective-c interoperability, JSON, Swift ibactions, Model-view-controller, Swift queues, Firebase, Uiimagepickercontroller, Https, Swift iboutlets, Swift autolayout, Secure network requests, Code refactoring, Git, Uikit classes, Apple app transport security protocol, Uitableview",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/discovering-ethical-AI--cd13462",
    "Course Name": "Discovering Ethical AI Course",
    "Description": "Ethical AI is one of the highest-impact, most in-demand skills. In this lesson, we’ll introduce you to basic concepts and terms that you’ll need to step into the world of Ethical AI.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Ethical AI Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/robotics-software-engineer--nd209",
    "Course Name": "Robotics Software Engineer Nanodegree Program",
    "Description": "Fuse computer vision, machine learning, mechanics, and hardware systems to build bots of the future!",
    "Level": "Advanced",
    "Prerequisites": "Basic C++, Linear algebra, Basic descriptive statistics, Basic calculus, Lidar",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "Automated path planning, Ros nodes, Occupancy grid mapping algorithm, Environment mapping, Fastslam, Gaussian distribution, Sample-based path planning, Probabilistic path planning, Graphslam, Slam, Particle filters, Breadth-first search, Turtlebot, Gmapping ros package, Kalman filters, Extended kalman filters, Robot operating system, Gazebo, A* search algorithm, Ros adaptive mcl package, Object localization, Environment modeling, Search algorithms in c++, Bayes' filter for localization, Monte carlo localization, Ros ekf package",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/ai-programming-python-nanodegree--nd089",
    "Course Name": "AI Programming with Python Nanodegree Program",
    "Description": "Develop a strong foundation in Python programming for AI, utilizing tools like NumPy, pandas, and Matplotlib for data analysis and visualization. Learn how to use, build, and train machine learning models with popular Python libraries. Implement neural networks using PyTorch. Gain practical experience with deep learning frameworks by applying your skills through hands-on projects. Explore generative AI with Transformer neural networks, learn to build, train, and deploy them with PyTorch, and leverage pre-trained models for natural language processing tasks. Designed for individuals with basic programming experience, this program prepares you for advanced studies in AI and machine learning, equipping you with the skills to begin a career in AI programming.",
    "Level": "Beginner",
    "Prerequisites": "Elementary algebra, Basic Python",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "NumPy, matplotlib, Vector visualization, Python data types, Control flow, Python operators, Training neural networks, Backpropagation, PyTorch, AI algorithms in Python, Gradient descent, Limits of functions, Integrals, Derivatives, Implicit differentiation, Chain rule application, Systems of linear equations, Linear algebra, Matrix multiplication, Python exception handling, Lambda expressions, Code debugging, Python function definition, List comprehension, Generators, Variable scope, Iterators, Built-in Python functions, Pip, File i/o, User input handling, Python data structures, Loops, Docstrings, Python scripting, Transformer neural networks",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/cloud-dev-ops-nanodegree--nd9991",
    "Course Name": "Cloud DevOps Engineer Nanodegree Program",
    "Description": "In this program, you’ll develop the skills you need to join the rapidly growing cloud devops field. ",
    "Level": "Intermediate",
    "Prerequisites": "Command line interface basics, NodeJS, AWS development, HTML, Basic SQL, Basic computer programming, Basic github, Basic JavaScript, Object-oriented JavaScript, Basic web development, Git",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Logging, Continuous integration, Continuous deployment, Github actions, Deployment automation, CI/CD, Build automation, Kubernetes, Serverless development, Cloud observability, Amazon ECR, Amazon CloudWatch, AWS lambda, Serverless cloud computing architecture, Docker, AWS networking services, AWS cloudformation, Cloud computing business context, Cloud security in AWS, AWS compute services, Vpc, AWS database services, Amazon s3, Cloud load balancing, Cloud autoscaling, Amazon rds, Amazon elastic compute cloud, Identity and access management fundamentals, Amazon simple notification service, Amazon vpc, AWS IAM, Amazon web services basics, AWS cli, AWS elastic beanstalk, Iam policies, Cloud computing fluency, Amazon DynamoDB, Computer networking basics, Cloud deployment models, Iam users",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/product-manager-nanodegree--nd036",
    "Course Name": "Product Manager Nanodegree Program",
    "Description": "Develop essential product management skills to launch successful products in today's competitive market. This comprehensive program covers the entire product lifecycle, from ideation to launch and beyond, teaching you market research, product strategy, roadmap creation, and development management. Through hands-on projects and real-world scenarios, you will gain practical experience and apply concepts directly to simulated product launches. You will be equipped with skills in market analysis, agile methodologies, user experience design, and data-driven decision-making, preparing you for roles in product management. This program is ideal for aspiring product managers and professionals looking to transition into product-focused roles.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Product design sprints, Product prototyping, Product launch, Product scaling, Project evaluation, Solution sketching, Problem validation, Product management basics, Product proposals, Stakeholder management, Product roadmaps, End-user documentation, Feedback loops, A/B testing, Project risk mitigation, Competitive analysis, Stakeholder identification, Decision matrix method, Product validation, User research planning, Evangelization, Press releases, Thinking hats, Crazy 8s, Product success metrics, Product design principles, User interviews, Iterative product design, Technical feasibility evaluation, Affinity mapping, Product storyboarding, Product KPIs, High fidelity prototypes, How might we method, Business model canvasses, Requirements gathering, Return on investment, User personas, Active listening, Professional presentations, Product development cycle, Storytelling, Product requirements documents, Total addressable market, Minimal viable products, Mixed methods market research, Product marketing, Product pricing strategy, Negotiation, Project management frameworks, Prioritization, Cross-functional collaboration, Functional testing, Real-world Testing, Persuasion",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/learn-sql--nd072",
    "Course Name": "SQL Nanodegree Program",
    "Description": "Master SQL, the essential language for data analysis and insight-driven decision-making. This program covers SQL fundamentals, advanced querying, and database management. Learn to work with multiple tables, perform data aggregation and cleaning, use window functions, and optimize queries for large datasets. Apply your skills to real-world projects, analyzing deforestation data and redesigning databases. Gain proficiency in SQL for data analysis, database design, and management, preparing for roles requiring strong data manipulation and insight generation. Ideal for aspiring data analysts, business intelligence professionals, and those seeking to enhance their data querying and management skills.",
    "Level": "Beginner",
    "Prerequisites": "Basic SQL",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "SQL subqueries, SQL joins, Mongodb, SQL CRUD commands, Database normalization, Redis, SQL aggregations, SQL window functions, SQL queries, Data cleaning, Database indexing, Data manipulation language, Query plans, Database schemas, SQL query performance tuning, Rdbms performance and optimization, Foreign keys, Database fundamentals, Business rule enforcement in databases",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/introduction-to-python--cd0024",
    "Course Name": "Introduction to Python  Course",
    "Description": "Learn Python programming fundamentals such as data types and structures, variables, loops, and functions.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P4W",
    "Language": "en",
    "Skills": "NumPy, Pandas, Control flow, Python scripting, Built-in Python functions, Python methods, Python function definition, Python package management, Python data types, Iterators, Python exception handling, Python best practices, Python operators, Python data structures, Docstrings, Anaconda, Python ides, Variable scope, List comprehension, Python syntax, User input handling",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-ai-ml--cd2019",
    "Course Name": "Discovering Artificial Intelligence and Machine Learning Course",
    "Description": "Discover Artificial Intelligence and Machine Learning, learn about how they work, and find out how they are used to solve problems in new ways that were never possible in the past.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Artificial Intelligence Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/data-analysis-and-visualization-with-power-BI-nanodegree--nd331",
    "Course Name": "Data Analysis and Visualization with Microsoft Power BI  Nanodegree Program",
    "Description": "This program will equip any learner who wants to develop in-demand skills in data pre-processing, visualization, and analysis using Power BI as the primary tool.",
    "Level": "Beginner",
    "Prerequisites": "Power BI Proficiency, Intermediate spreadsheet use, Database schemas",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Power BI Report Customization, Data visualization design, Dax, Data transformation, Power query, Power BI Report Design, Data fluency, Advanced data visualizations, Business reporting fluency, Relational data models, Power BI Calculated Columns and Measures, Data extraction, Predictive analytics, Historical data analysis, Stakeholder management, Basic descriptive statistics, Data storytelling, Basic data visualizations, Data visualization, Business metrics, Power BI Data Types, Power BI Get Data, Power BI Data Pipeline, Table design",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/data-product-manager-nanodegree--nd030",
    "Course Name": "Data Product Manager Nanodegree Program",
    "Description": "Existing PMs wanting to get deeper tech expertise in the Data domain to be more self-sufficient during product development and maintenance process.",
    "Level": "Intermediate",
    "Prerequisites": "Basic descriptive statistics, Tableau proficiency, Basic spreadsheet use, Basic SQL",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Data pipelines, Product KPIs, Cohort analysis, Data pipeline design, Relational data models, Data storytelling, Multivariate testing, Tableau visualizations, A/B testing, Data infrastructure basics, Data consumers, Exploratory data analysis, Experiment control, Product feature usage metrics, Experiment design, Data gathering, Quantitative data analysis, Data limitations and biases, Interpreting test results, Qualitative user research, Iterative product design, Acquisition funnels, Qualitative data analysis, Data warehouse management, Data wrangling fundamentals, Types of data, Event data models, Data producers, Big data storage, Feedback loops, Data augmentation, Stakeholder identification, Probability distribution, Chart types, Product proposals, Data definition, Product management basics, Product goals, Database schemas, Marketing metrics, Rice framework, Feature prioritization, Behavioral market segmentation, Data privacy regulations, Stream processing, Data use-cases, Data security fundamentals, Data storage, Batch processing, SQL queries",
    "Rating": 4.3
  },
  {
    "URL": "https://www.udacity.com/course/discovering-data-science--cd2018",
    "Course Name": "Discovering Data Science Course",
    "Description": "Data science is one of the highest-impact, most in-demand skills. In this course, we'll introduce you to the fundamental concepts and terms that you'll need to step into the world of data science.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Data Science Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/java-developer-nanodegree--nd035",
    "Course Name": "Java Web Developer Nanodegree Program",
    "Description": "Learn enterprise scale back-end development with Java, and be prepared for the software engineering jobs that are in demand at a majority of Fortune 500 companies like Google, Amazon, and more.",
    "Level": "Intermediate",
    "Prerequisites": "Basic SQL, Intermediate Java",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Object-relational mapping, Graphql, Swagger, Docker, Selenium, Spring data jpa, Spring boot configuration, Jpa, REST APIs, Git, Web services, Spring mvc, Servlets, Splunk, Unit testing, Multitier architecture, Spring security, Microservices, Spring managed components, Mybatis, Thymeleaf, Model-view-controller, Logging, Junit, Application security best practices, CI/CD, Code coverage, Application security basics, Jenkins, Hibernate ORM, Software testing, Spring boot, Soap, Microservices architecture basics, Front-end development basics, Java testing, Functional testing, Application servers, Maven, Repository design pattern, Data format fundamentals, Java package management, HtML template creation, Dependency injection, Java annotations, Negative testing, Jwts, Happy path testing, Hashing, Jpql, DAOs, SQL queries, Java data types, Relational database transactions, Jdbc, Dtos, SQL scripts, Java inheritance, JSON, API documentation, HTTP, XML, API security, API development, Java assertions, Behavioral software testing, Application metrics, Integration testing, Errors and exceptions, Data encryption, Intellij, Spel",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/ai-product-manager-nanodegree--nd088",
    "Course Name": "AI Product Manager Nanodegree Program",
    "Description": "The AI Product Manager Nanodegree Program offers a comprehensive overview of AI and machine learning for business. It covers the basics of AI, how to leverage existing datasets with AI, how to collect or create bespoke datasets for custom AI applications, and how to use the latest Generative AI technologies. In the first project, learners will create a Product Requirements Document (PRD) for a product that incorporates AI personalization and forecasting. Then, in the second project, learners will develop a roadmap for an AI product that requires custom data annotations. Finally, in the third project, learners will build a product strategy for incorporating Large Language Models (LLMs) into an existing product, including plans for measuring both performance metrics and bias metrics.",
    "Level": "Intermediate",
    "Prerequisites": "Product management basics",
    "Duration": "P4W",
    "Language": "en",
    "Skills": "Model bias analysis, Conversational AI, Data limitations and biases, NLP proficiency, Model performance metrics, Model bias mitigation, NLP business context, GenAI Strategy, Dataset annotation, Rice framework, Product roadmaps, Computer vision business context, Stakeholder management, Types of ML applications, Recommendation engine fluency, AI fluency, Machine learning use cases, AI business context, Recommendation engine business context, Time-Series Forecasting Basics, GenAI Use Cases, Time-Series Forecasting Business Context:",
    "Rating": 4.4
  },
  {
    "URL": "https://www.udacity.com/course/generative-AI-with-AWS--cd13232",
    "Course Name": "Introducing Generative AI with AWS Course",
    "Description": "Master the fundamentals of generative AI and develop a deep understanding of its historical context and real-world applications. Explore AI and machine learning foundations using AWS tools, large language models (LLMs) with transformer-based architectures, and the societal impacts of generative AI to understand AI's evolution and ethical deployment. Engage in exercises on AI history, machine learning approaches, prompt engineering, and responsible AI use to apply your knowledge in practical scenarios. Develop skills in distinguishing AI from ML, exploring LLMs, and emphasizing ethical AI deployment, enabling you to apply these concepts in real-world applications. Designed for learners with basic Python knowledge, this program empowers you to advance your understanding of generative AI.",
    "Level": "Beginner",
    "Prerequisites": "Basic Python",
    "Duration": "P2W",
    "Language": "en",
    "Skills": "Convolutional neural networks, Amazon sagemaker, Generative AI Fluency, Prompt Engineering, Basic supervised machine learning",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/predictive-analytics-for-business-nanodegree--nd008t",
    "Course Name": "Predictive Analytics for Business Nanodegree Program",
    "Description": "Learn to clearly define business issues, prepare and clean data, and implement a variety of predictive modeling techniques.",
    "Level": "Intermediate",
    "Prerequisites": "Basic spreadsheet use, Basic descriptive statistics",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Data storytelling, Tableau data pane, Tableau map-based visualizations, Tableau interactive dashboards, Tableau field organization and customization, Data visualization design, Tableau visualizations, Chart selection, Tableau storypoint, Tableau calculated fields, Demographic market segmentation, K-means clustering, Dimensionality reduction, Cluster validation, Data pre-processing, Cluster models, Model evaluation, Ets models, Arima, Univariate time-series analysis, Differencing of time-series data, Alteryx, Time-series analysis, Forecast visualization, A/B testing, Statistical sampling, Interpreting test results, Experiment control, Model interpretation, Stepwise regression, Gradient boosting, Model scoring, Logistic regression, Classification models, Random forest models, Decision trees, Data cleaning, Data extraction, ETL, Types of data, Data transformation, CRISP-DM, Data analysis business context, Analytic frameworks, Linear regression",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/android-kotlin-developer-nanodegree--nd940",
    "Course Name": "Android Kotlin Developer Nanodegree Program",
    "Description": "Learn the latest in development technology using Android Studio",
    "Level": "Intermediate",
    "Prerequisites": "Object-oriented programming basics, Concurrent computing, Modular application architecture",
    "Duration": "P5M",
    "Language": "en",
    "Skills": "Android custom views, Firebase, Android notifications, Recyclerview, Android activity lifecycle, Google maps in android development, Mobile app testing, Offline caching, Model-view-viewmodel architecture, Multi-screen app design, Android studio, Android development basics, Mockito, Integration testing, Location-aware app development, Dependency injection, Identity and access management fundamentals, Espresso testing framework, Declarative XML, Android property animations, Application animations, Android ui development, Talkback, Glide, Responsive app design, App localization, Retrofit, Rtl, Fetching data, Android development environment, Android best practices, Data binding",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/data-streaming-nanodegree--nd029",
    "Course Name": "Data Streaming Nanodegree Program",
    "Description": "Learn the latest skills to process data in real-time by building fluency in modern data engineering tools, such as Apache Spark, Kafka, Spark Streaming, and Kafka Streaming.",
    "Level": "Advanced",
    "Prerequisites": "Intermediate Python, ETL, Basic descriptive statistics, Intermediate SQL",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Faust, Confluent Kafka Python client, Kafka rest proxy, KSQL, Apache Spark, Stream processing, Kafka connect, Streaming data stores, Kafka basics, Apache Avro, SQL window functions, SQL aggregations, Data streaming schemas, Stream processing use cases, SQL queries, JSON, Kafka performance monitoring, Data serialization, Data deserialization, Data privacy principles, Base64, Batch processing, Kafka schema registry, Timeframing in stream processing, Command line interface basics, Windowing in stream processing",
    "Rating": 4.4
  },
  {
    "URL": "https://www.udacity.com/course/marketing-analytics-nanodegree--nd028",
    "Course Name": "Marketing Analytics Nanodegree Program",
    "Description": "Gain foundational data skills applicable to marketing. Collect and analyze data, model marketing scenarios, and communicate your findings with Excel, and Tableau.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Marketing macro-analytics, Marketing analytics, Digital marketing metrics, Marketing metrics, Marketing channels, Earned media metrics, Aarrr metrics framework, Paid marketing metrics, Marketing data collection, Forecast modeling in spreadsheets, Data validation in spreadsheets, Tableau interactive dashboards, Tableau field organization and customization, Data visualization design, Chart selection, Tableau storypoint, Tableau calculated fields, Data storytelling, Tableau data pane, Tableau map-based visualizations, Tableau visualizations, Pivot tables, Chart types, Inferential statistics, Spreadsheet functions, Quantitative data visualization, Basic descriptive statistics, Basic spreadsheet use, Categorical data visualization, Professional presentations",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/ai-for-business-leaders--nd054",
    "Course Name": "AI For Business Leaders Nanodegree Program",
    "Description": "Formulate and evaluate proposals grounded in first principles when assessing opportunities to embed machine learning and artificial intelligence into a corporate strategy. ",
    "Level": "Beginner",
    "Prerequisites": "Basic descriptive statistics, Basic probability",
    "Duration": "P1M",
    "Language": "en",
    "Skills": "Machine learning fluency, Beta testing, Machine learning dataset fundamentals, Machine learning system architectures, Machine learning use cases, Product storyboarding, Product proposals, Model performance metrics, AI business context, Product roadmaps, Dataset annotation, AI fluency, Machine learning experiments, Iterative product design, Overfitting prevention, Deep learning fluency, Reinforcement learning applications, Ethical AI",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-machine-learning-nanodegree--nd229",
    "Course Name": "Introduction to Machine Learning with Pytorch Nanodegree Program",
    "Description": "Build powerful machine learning models to make predictions and uncover hidden patterns. Start with foundational supervised learning algorithms, including linear regression, decision trees, naive Bayes, support vector machines (SVMs), and perceptrons, then evaluate your model performance with a variety of evaluation metrics. Then, you'll advance from perceptrons to deep neural networks in order to perform supervised learning on complex data sources such as images. Finally, you'll dive into unsupervised learning methods, including clustering and dimensionality reduction for customer segmentation. For each technique, you'll start by learning the underlying math, then implement real-world models with Python libraries, including PyTorch and scikit-learn.",
    "Level": "Intermediate",
    "Prerequisites": "Multivariable calculus, Data wrangling, Python for data science, Basic supervised machine learning, Intermediate Python, Linear algebra, Basic descriptive statistics, Basic calculus, Basic probability",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Naive bayes classifiers, Gaussian mixture models, Model evaluation, Support vector machines, Decision trees, Single linkage clustering, K-means clustering, Dimensionality reduction, Market segmentation, Cluster models, Principal component analysis, Independent component analysis, Dbscan, Convolutional kernels, scikit-learn, Perceptron, Categorical data visualization, Statistical modeling fundamentals, Chart types, Quantitative data visualization, Linear regression, Spam detection, Logistic regression, Professional presentations, Hyperparameter tuning, Gradient descent, AI algorithms in Python, Training neural networks, NumPy, Backpropagation, Overfitting prevention, Deep learning fluency, PyTorch",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/sensor-fusion-engineer-nanodegree--nd313",
    "Course Name": "Sensor Fusion Nanodegree Program",
    "Description": "The Sensor Fusion Engineer Nanodegree program consists of four courses that teach the fundamentals of sensor fusion and perception for self-driving cars. The program covers lidar, radar, camera, and Kalman filters, and includes lessons on working with real-world data, filtering, segmentation, clustering, and object tracking. In addition, students will work on a capstone project that involves building a complete sensor fusion pipeline for autonomous vehicles. Upon completing the program, graduates will have the skills and knowledge necessary to design and implement sensor fusion systems for self-driving cars.",
    "Level": "Advanced",
    "Prerequisites": "Basic calculus, Basic probability, Intermediate C++, Linear algebra",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Radar, Sensor fusion, Digital cameras, Kalman filters, Point clouds, Radar clutter thresholding, Digital image keypoint descriptors, Object tracking, Point cloud data, Fourier transforms, Sift algorithm, Unscented kalman filters, Basic trigonometry, Autonomous vehicle fluency, Sae j3016 levels of driving automation standard, Ransac algorithm, Non-linear motion tracking, Radar angle of arrival, Autonomous vehicle sensor selection, Curve fitting, Extended kalman filters, Cluster models, Object motion models, Computer vision image filtering, Image gradient calculation, Object clustering, K-d trees, Point cloud library, Lidar visualization, Lidar, Sensor specifications, Multi-target object tracking, Object detection, Yolo algorithm, Digital image keypoints, Computer vision image transformations, Lidar measurement models, Harris detector, Camera measurement models, Feature detection, Collision detection, Opencv, Lidar data representation, Lidar simulator, Euclidean clustering, Robot trajectory generation, C++ for robotics, Jacobians, Radar range resolution, Radar velocity estimation, Radar velocity resolution, Radar range estimation, Radar angle resolution, Bounding boxes",
    "Rating": 4.8
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-machine-learning-with-tensorflow-nanodegree--nd230",
    "Course Name": "Introduction to Machine Learning with TensorFlow Nanodegree Program",
    "Description": "Build powerful machine learning models to make predictions and uncover hidden patterns. Start with foundational supervised learning algorithms including linear regression, decision trees, naive Bayes, support vector machines (SVMs), and perceptrons, then evaluate your model performance with a variety of evaluation metrics. Then you'll advance from perceptrons to deep neural networks in order to perform supervised learning on complex data sources such as images. Finally, you'll dive into unsupervised learning methods, including clustering and dimensionality reduction for customer segmentation. For each technique, you'll start by learning the underlying math, then implement real-world models with Python libraries including TensorFlow and scikit-learn.",
    "Level": "Intermediate",
    "Prerequisites": "Basic descriptive statistics, Data wrangling, Python for data science, Basic probability, Basic calculus, Linear algebra, Intermediate Python, Basic supervised machine learning, Multivariable calculus",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Naive bayes classifiers, Gaussian mixture models, Model evaluation, Support vector machines, Decision trees, Single linkage clustering, K-means clustering, Dimensionality reduction, Market segmentation, Cluster models, Principal component analysis, Independent component analysis, Dbscan, Convolutional kernels, scikit-learn, Perceptron, Categorical data visualization, Statistical modeling fundamentals, Chart types, Quantitative data visualization, Linear regression, Spam detection, Logistic regression, Professional presentations, Hyperparameter tuning, Training neural networks, NumPy, Backpropagation, Overfitting prevention, Deep learning fluency, TensorFlow, Gradient descent, AI algorithms in Python",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/data-visualization-nanodegree--nd197",
    "Course Name": "Data Visualization Nanodegree Program",
    "Description": "This Data Visualization Nanodegree program covers four courses on data visualization and storytelling. Students will learn to select appropriate visualizations, design effective dashboards, and tell data stories that uncover insights and make recommendations. They will use Tableau to build interactive dashboards and create polished presentations with data visualizations. Through a series of projects, students will learn to discover user needs, identify key metrics, prototype, and design dashboards, analyze data to find insights and communicate recommendations effectively.",
    "Level": "Beginner",
    "Prerequisites": "Explanatory data analysis, Basic computer literacy, Basic descriptive statistics, Tableau proficiency, Spreadsheet functions, Propositional logic, Basic data visualizations, Exploratory data analysis, Basic spreadsheet use",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Animated data visualizations, Flourish, Data storytelling, Data limitations and biases, Data visualization design, Tableau pages, Tableau storypoint, Tableau interactive dashboards, Problem statements, Professional presentations, Ghost decks, Roadmaps, Issue trees, Usability testing, Wireframes, Feedback loops, Business KPIs, Stakeholder analysis, Chart types, Tableau calculated fields, Tableau map-based visualizations, Tableau data pane, Tableau field organization and customization, Chart selection, Tableau visualizations",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/deep-reinforcement-learning-nanodegree--nd893",
    "Course Name": "Deep Reinforcement Learning Nanodegree Program",
    "Description": "Develop advanced AI solutions with applications ranging from robotics to financial trading. To gain a foundation in AI techniques, you will implement classical solution methods, define Markov decision processes, policies, and value functions, and derive Bellman equations. Then, you will learn dynamic programming, Monte Carlo methods, temporal-difference methods, and deep reinforcement learning (deep RL) and apply these techniques to solve real-world problems. You will train agents to navigate virtual worlds, generate optimal financial trading strategies, and apply RL to multiple interacting agents.",
    "Level": "Advanced",
    "Prerequisites": "Intermediate Python, Deep learning framework proficiency, Neural network basics, Object-oriented programming basics, Reinforcement learning fundamentals",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "Value-based reinforcement learning, Stochastic policy gradients, Reinforce algorithm, Exploration-exploitation dilemma, Markov decision processes, Multi-agent training, Markov games, Alphazero, Policy optimization algorithms, Evolutionary algorithms, Monte carlo policy gradients, Generalized advantage estimation, Prioritized experience replay, Deep q-networks, Double deep q-networks, Dueling deep q-networks, Multi-armed bandit problems, Bellman equation, Policy-based reinforcement learning, Continuous functions, Monte carlo methods, Dynamic programming",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/intermediate-python-nanodegree--nd303",
    "Course Name": "Intermediate Python Nanodegree Program",
    "Description": "Python is a general-purpose coding language with applications in web development, data science, machine learning, fintech, and more. The Intermediate Python Nanodegree program equips you to leverage the capabilities of Python and streamline the functionality of applications that perform complex tasks, such as classifying files, data mining a webpage, etc. By the end of the program, you’ll have a portfolio that demonstrates your ability to apply practitioner-level Python skills on the job.\n\n",
    "Level": "Intermediate",
    "Prerequisites": "Basic Python, Control flow",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "File i/o, Functional programming concepts, Python data structures, Python library fluency, Object-oriented Python, Command line tools, Python virtual environments, Web services, Application servers, Pythonic design patterns, Python exception handling, Python data types, Python scripting, Object creation design patterns, Pip, Abstraction, Python best practices, Flask, Code debugging, Magic methods, Pep8, Modular code, Application routing, Python package management, Inheritance, Scripting, Application dependency management, Python modules, Fetching data, API fluency, REST APIs, Python namespaces, Python classes, JSON, Python function definition, Python decorator functions, Object-oriented design patterns",
    "Rating": 4.4
  },
  {
    "URL": "https://www.udacity.com/course/full-stack-javascript-developer-nanodegree--nd0067",
    "Course Name": "Full Stack JavaScript Developer Nanodegree Program",
    "Description": "The Full Stack JavaScript Developer Nanodegree program will equip learners with everything a developer needs to build rich experiences delivered with the web using modern architecture and technology.",
    "Level": "Intermediate",
    "Prerequisites": "Basic typescript, HTTP, Command line interface basics, CSS, JSON, Basic JavaScript, Object-oriented JavaScript, Dom events",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "API development, AWS elastic beanstalk, Angular cli, Scripting, NodeJS, Amazon s3, Angular components, Database schemas, Hashing, Database fundamentals, API testing, Express web framework, Deployment automation, Angularjs, JavaScript package management, Application dependency management, Web forms, User input handling, Jasmine, PostgreSQL, API requests, Jwts, SQL queries, REST APIs, Asynchronous JavaScript, File i/o, Circleci, Angular templates, Angular directives, Angular router, Data binding, Data definition, Crud model, Node-postgres, Cors, Eslint, Typescript syntax, Test-driven development, Amazon rds, Devops documentation, Automation testing, Continuous integration, Test environments, Data security fundamentals, Object-document mapping, SQL joins, Nodejs environment variables, Relational database migration, Unit testing, Prettier, Typescript typing, AWS cli, Continuous deployment, CI/CD, Inversion of control, HTML, Dependency injection, Application authorization, Coding best practices, Salt, Pepper, Application authentication, Application security best practices, Typescript setup, JavaScript event loop, Typescript promises, Typescript async/await, Typescript exception handling",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/ai-for-healthcare-nanodegree--nd320",
    "Course Name": "AI for Healthcare Nanodegree Program",
    "Description": "The AI for Healthcare program offers two courses that apply AI to 2D and 3D medical imaging data. The first course covers fundamental skills needed to work with 2D imaging data, such as extracting images from DICOM files, building AI models, and obtaining regulatory approval. The course project involves training a CNN to classify chest X-rays for the presence of pneumonia and writing an FDA validation plan. The second course covers 3D imaging data, including clinical fundamentals, imaging modalities, and common analysis tasks. It also explores how AI can be integrated into the clinical workflow. Both courses are designed to teach students how to derive clinically relevant insights from medical imaging data using AI.",
    "Level": "Advanced",
    "Prerequisites": "Data cleaning, Machine learning frameworks in Python, Basic supervised machine learning, Intermediate Python",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "Feature engineering, Medical and healthcare regulations and standards, Medical imaging basics, Fda medical device framework, Signal-to-noise ratio, Electrocardiographs, Medical code sets, Clinical basics, Dicom, Pydicom, AI for 2d medical imaging, Basic heart physiology, Pan-tompkins algorithm, Machine learning pipeline creation, Exploratory data analysis, Classification models, Time and space domain dsp techniques, Sensors, matplotlib, Digital sampling, Signal visualization, Overfitting prevention, Frequency domain dsp techniques, Shapley value, TensorFlow, Healthcare privacy regulations, ETL, Model uncertainty estimation, Model bias analysis, Data splitting, Model performance metrics, Tensorflow dataset API, Aequitas, Tensorflow probability library, Clinical environment modeling, Multiplanar reconstruction, Image segmentation, Convolutional kernels, Nibabel, Microdicom, Digital signal windowing, U-net, Image classification, Data pre-processing for ML, 3d slicer, Data preparation, PyTorch, AI for 3d medical imaging, Nifti, 3d reconstruction, Medical imaging data formats, Hyperparameter tuning, Data augmentation, Image pre-processing, Data pre-processing, Convolutional neural networks, Dataset annotation, Transfer learning, Keras, Machine learning system architectures",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/dev-ops-fluency--cd5234",
    "Course Name": "DevOps Fluency Course",
    "Description": "In this course, you will explore concepts of DevOps including Infrastructure as Code, Configuration Management, Continuous Integration, Continuous Delivery,  and Automated Testing and Monitoring.",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "P2W",
    "Language": "en",
    "Skills": "Devops fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/data-analysis-and-visualization-fluency--cd5224",
    "Course Name": "Data Analysis and Visualization Fluency Course",
    "Description": "Learn about the data analysis process, key steps in data wrangling, basic data types, summary statistics, how to design good data visualizations, common types of charts and plots, and how to tell a story with your visuals.",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "PT5H",
    "Language": "en",
    "Skills": "Data fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-agile--cd2020",
    "Course Name": "Discovering Agile Course",
    "Description": "Agile is one of the highest-impact, most in-demand skills. In this course, we'll introduce you to the fundamental concepts and terms that you'll need to step into the world of agile.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Agile Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-data-analysis-and-visualization--cd2703",
    "Course Name": "Discovering Data Analysis and Visualization Course",
    "Description": "Data analysis and visualization is one of the highest-impact, most in-demand skills. In this course, we'll introduce you to the fundamental concepts and terms that you'll need to step into this world.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Data Analysis Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/java-programming-nanodegree--nd079",
    "Course Name": "Java Programming Nanodegree Program",
    "Description": "This Nanodegree program is intended to elevate your Java abilities and teach you the fundamental skills used by Java developers to design, code, test and deploy cutting-edge Java software.",
    "Level": "Intermediate",
    "Prerequisites": "Basic Java, Basic computer programming",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Java collections, Maven, Java data types, Java inheritance, Java syntax, Unit testing, Java modules, Java reflection, Design pattern fundamentals, Java generics, Java exception handling, JRE, Intellij, Wiremock, Jshell, Jdk, Mockito, Junit, Jlink, Integration testing, Java stream API, Dependency injection, Computer memory familiarity, Java files API, Data encoding, Aspect-oriented programming, Resource leaks, Java best practices, Concurrent computing, Programming paradigms, Date and time in Java, Java standard library, Java enums, Java documentation, Java data structures, Regular expressions, Java package management, Java string methods, Data serialization, Behavioral design patterns, Threading, Creational design patterns, Data deserialization, Structural design patterns, Parallel computing, Computer memory architecture, Java methods, Control flow in Java, Java arrays, Java type casting, Functional programming",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/discovering-data-literacy--cd12066",
    "Course Name": "Discovering Data Literacy  Course",
    "Description": "Data literacy is one of the highest-impact, most in-demand skills. In this lesson, we'll introduce you to the fundamental concepts and terms that you'll need to step into the world of data literacy.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Data Literacy Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/data-architect-nanodegree--nd038",
    "Course Name": "Data Architect Nanodegree Program",
    "Description": "Gain the expertise to structure, manage, and safeguard enterprise-level data systems with this program. You'll learn advanced skills in database design, data modeling, and cloud integration, equipping you to make data-driven decisions and architect resilient systems for modern businesses. With a focus on high-demand skills, this program also covers essential topics in data security and governance, ensuring you're prepared to build scalable, efficient, and secure data infrastructures tailored to organizational needs.",
    "Level": "Advanced",
    "Prerequisites": "Basic computer programming, Relational database basics, Basic SQL, JSON, Command line interface basics, Intermediate SQL",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Data architecture fluency, Master data management, Big data fluency, Data quality assessment, Metadata management, Data staging, Data ingestion, Erds, Data governance fluency, Distributed data processing, Star schemas, Data definition language, Data manipulation language, Data lake management, Database fundamentals, Database scalability, Data storage, SQL CRUD commands, Crow's foot notation, Data governance business context, Hdfs, Data format fundamentals, NoSQL, Hadoop, Database frameworks, ELT, SQL queries, Database normalization, Data cleaning, Database schemas, Data dictionaries, Physical erds, Logical erds, 3rd normal form, Database performance, Enterprise data models, Metadata management systems, Data profiling, Data lake design patterns, NoSQL data models, Data lakes, Snowflake schemas, Database flexibility, Conceptual erds, PostgreSQL, Acid properties, Distributed data storage, Amazon DynamoDB, Cap theorem, Big data business context, Data definition, Online transactional processing models, Operational data store models, Online analytical processing models, Lucidchart, ETL, Crud model",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/discovering-quantum-computing--cd13463",
    "Course Name": "Discovering Quantum Computing Course",
    "Description": "Have you ever wondered how computers might crack some of our toughest challenges? Get ready to explore the fascinating world of Quantum Computing! This revolutionary technology is set to completely change how we tackle complex problems. Through real-world examples and simple illustrations, you'll gain a clear understanding of the key ideas behind Quantum Computers, along with the exciting possibilities and real risks of this cutting-edge field.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Quantum Computing Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/machine-learning-engineer-for-microsoft-azure-nanodegree--nd00333",
    "Course Name": "Machine Learning Engineer with Microsoft Azure Nanodegree Program",
    "Description": "Learn Azure ML Operations and the skills utilized by Azure Machine Learning Engineers. Gain a working knowledge of workspaces, datastores, key components of a machine learning pipeline, and how to deploy models and consume endpoints. Demonstrate knowledge learned through the building, deployment, and analysis of two customized models in a capstone project. \n",
    "Level": "Intermediate",
    "Prerequisites": "HTTP, Basic Python, Model training",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Azure ML user management, Azure data services, AI business context, Azure ML platform, Model deployment with Azure, Azure ML pipelines, Kubernetes security, API troubleshooting, REST APIs, Open neural network exchange, Hyperparameter tuning, Azure ML designer, Model interpretation, Azure ML sdk, Azure ML experiments, Model maintenance, Cloud asset management, Deployment testing, Azure kubernetes service, Swagger, Docker, Model evaluation, Kubernetes, ApacheBench, Azure ml automated ML",
    "Rating": 4.1
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-cybersecurity-nanodegree--nd545",
    "Course Name": "Introduction to Cybersecurity Nanodegree Program",
    "Description": "Build a strong foundation in cybersecurity to protect digital assets and manage risk effectively. This program covers core skills like threat analysis, vulnerability assessment, and network defense, preparing you to identify and respond to cyber threats. You'll learn to implement security measures, use industry-standard tools, and understand best practices to safeguard sensitive data, ensuring readiness for today’s security challenges in both personal and professional contexts.",
    "Level": "Beginner",
    "Prerequisites": "Operating system fundamentals, Command line interface basics",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Threat intelligence, Cryptography, Cybersecurity fluency, Security auditing, Vulnerability management, Cybersecurity grc, Cybersecurity business context, Security information and event management, Systems security, Cybersecurity compliance, Cybersecurity risk management, Cybersecurity controls, Cybersecurity incident response playbooks, Security assessment, Identity and access management fundamentals, Patch management, Security architecture fundamentals, Cybersecurity policy writing, Stakeholder management, Value-based security risk assessment, Security risk classification, Cybersecurity standards fluency, Security risk remediation, Cybersecurity training strategies, Offensive security, Intrusion protection systems, Firewall rules, Nist 800-series, Firewalls, Data security fundamentals, Network security best practices, Intrusion detection systems, Did framework, Computer networking basics, Network security reports, Cybersecurity governance, Nist cybersecurity framework, Cybersecurity regulations and standards, Exploit detection, Data privacy regulations, Cis controls, Email security",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/discovering-digital-transformation--cd2704",
    "Course Name": "Discovering Digital Transformation Course",
    "Description": "In this world where everything is digital, your mindset needs to be digital too. In this course, we will introduce you to the fundamental concepts that you'll need to step into the world of digital transformation.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Digital Transformation Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-business-analytics--cd11523",
    "Course Name": "Discovering Business Analytics Course",
    "Description": "Business analytics is one of the highest-impact, most in-demand skills. This course will introduce you to some basic concepts and terms that you'll need to step into business analytics.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Business Analytics Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/machine-learning-dev-ops-engineer-nanodegree--nd0821",
    "Course Name": "Machine Learning DevOps Engineer Nanodegree Program",
    "Description": "Automate and streamline the deployment of machine learning models, combining software engineering principles with machine learning workflows. This program covers key skills like writing production-ready code, creating reproducible workflows, and building automated deployment pipelines. Through real-world projects, you’ll develop scalable pipelines, version control for data and models, monitor model performance, and implement CI/CD processes to ensure resilient, maintainable systems. Ideal for data scientists aiming to operationalize their models, these skills empower you to build effective, long-term solutions tailored for industry demands.",
    "Level": "Advanced",
    "Prerequisites": "Command line interface basics, Basic descriptive statistics, Jupyter notebooks, Basic machine learning, Intermediate Python, REST APIs, Machine learning frameworks in Python, Python for data science",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Git, Machine learning ops troubleshooting, Dvc, Automated machine learning, ML project reporting, Automated model scoring, API configuration, Model drift, Continuous model updating, API requests, Model score recording, Machine learning data recording, Data ingestion, Model deployment, Continuous integration, Machine learning experiment tracking, Software development automation, Github actions, Continuous deployment, Unit testing, Heroku, FastAPI, API development, Model documentation, Aequitas, API testing, Machine learning pipeline creation, Data slicing, API deployment, Model bias analysis, Machine learning configuration management, Exploratory data analysis, Weights & biases, Data cleaning, Hydra, Data versioning, Non-deterministic data testing, Deterministic data testing, Pytest, MLflow, Data validation, Model testing, Data pre-processing for ML, Model evaluation, Inference pipelines, Data splitting, Model performance metrics, Python testing, Github collaboration, Coding best practices, Python documentation, Pep8, Linting, Code refactoring, Test automation, Python exception handling, Logging, Github branches, Code reviews",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/discovering-generative-ai--cd14197",
    "Course Name": "Discovering Generative AI Course",
    "Description": "Learners will discover the core concepts of Generative AI and how it works across a variety of fields. This course breaks down the often complex technology into digestible content, emphasizing real-world examples and non-technical applications. Learners will also explore the ethical considerations of using AI and gain insight into how they might use generative AI in their own work and lives.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT45M",
    "Language": "en",
    "Skills": "GenAI Use Cases, Generative AI Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/intermediate-javascript-nanodegree--nd032",
    "Course Name": "Intermediate JavaScript Nanodegree Program",
    "Description": "The goal of this program is to prepare students for roles in web development, server-side application development, and desktop development that require advanced  JavaScript skills.",
    "Level": "Intermediate",
    "Prerequisites": "Basic JavaScript, Dom events",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "JavaScript promises, Object-oriented JavaScript, Functional JavaScript, JavaScript async/await, Functional programming concepts, Variable scope, Asynchronous JavaScript, Programming paradigms, Immutable data, Object creation design patterns, Threading, JavaScript exception handling, Callbacks, Fetching data, JavaScript syntax, Redux, JavaScript object methods, Functional programming, Angularjs, The document object model, JavaScript variables, Arrays in JavaScript, Iifes, JavaScript functions, JavaScript methods",
    "Rating": 4.4
  },
  {
    "URL": "https://www.udacity.com/course/cloud-developer-using-microsoft-azure-nanodegree--nd081",
    "Course Name": "Cloud Developer using Microsoft Azure Nanodegree Program",
    "Description": "This program teaches how to deploy, build, migrate, and monitor applications on Azure, thereby preparing learners for success on Microsoft’s AZ-204 Azure Developer Associate Expert certification",
    "Level": "Intermediate",
    "Prerequisites": "Intermediate Python, Database fundamentals, Basic web development",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Cloud migration, Cloud security in Azure, Microservices architecture basics, Azure monitor, Cloud cost management, SQL databases in Azure, Cloud observability, Azure automation, Azure app service, Azure logic apps, Azure event grid, Azure resource groups, Azure blob storage, Cloud resource allocation, Azure compute service, Microservices architecture design, Azure log analytics, Root cause analysis, Cloud availability, Azure autoscale, Azure batch, Azure database migration service, API security, Azure kubernetes service, Azure cosmosdb, Azure API endpoints, Azure container registry, Cloud computing fluency, Azure portal, Azure functions",
    "Rating": 4.3
  },
  {
    "URL": "https://www.udacity.com/course/digital-transformation-for-business-leaders--nd055",
    "Course Name": "Digital Transformation for Business Leaders Nanodegree Program",
    "Description": "Embark on a transformative journey to lead your organization through digital change with this program. Learn to define digital transformation and leverage emerging technologies for business value. Key components include shifting your mindset, exploring transformation strategies, and translating opportunities into actionable goals. The course covers essential technologies like cloud computing, AI, and cybersecurity, equipping you to implement these tools strategically. With insights from experienced leaders and hands-on projects, you'll develop a customized roadmap for your digital transformation and a talent plan to align your team’s skills with strategic objectives. This program is perfect for leaders seeking innovation and competitiveness in the digital age.",
    "Level": "Intermediate",
    "Prerequisites": "",
    "Duration": "P1W",
    "Language": "en",
    "Skills": "Digital transformation strategy, Organizational change management",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/introduction-to-generative-ai-studio-with-google-cloud--cd13292",
    "Course Name": "Get Started with Vertex AI Studio with Google Cloud Course",
    "Description": "This course introduces Vertex AI Studio, a tool for prototyping and customizing generative AI models. Through immersive lessons, engaging demos, and a hands-on lab, you'll explore the generative AI workflow and learn how to leverage Vertex AI Studio for Gemini multimodal applications, prompt design, and model tuning. The aim is to enable you to unlock the potential of these models in your projects with Vertex AI Studio.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "PT35M",
    "Language": "en",
    "Skills": "Vertex AI Studio",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/agile-software-development-nanodegree--nd144",
    "Course Name": "Agile Software Developer Nanodegree Program",
    "Description": "Learn best practices for using an Agile framework to build better products faster and more efficiently.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Agile metrics, Sprint planning, Continuous improvement, Agile communication, Building agile teams, Sprint retrospectives, Big visible information radiator, Agile governance, Technical debt management, Backlog management, User stories, Product release planning, Product backlogs, Agile fluency, Product iteration planning, Project risk mitigation, Agile velocity, Minimal viable products, CI/CD, Acceptance criteria, Product roadmaps, Definition of done, Feature prioritization, Kanban, Scrum, Agile manifesto, Waterfall project management, Agile frameworks, Xp framework",
    "Rating": 4.6
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-ai-ml-fluency--cd1930",
    "Course Name": "AI/ML Fluency Course",
    "Description": "In this course, you will learn fundamental topics of artificial intelligence and machine learning. You will learn about what they are, different algorithms/methods, and their applications.",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "PT5H",
    "Language": "en",
    "Skills": "AI fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/how-to-use-chatgpt--cd13054",
    "Course Name": "How to Use ChatGPT Course",
    "Description": "This learning experience will guide you through using ChatGPT, a large language model developed by OpenAI.  You'll gain in-depth knowledge of the underlying technology that powers ChatGPT and master the art of prompt design while exploring its capabilities, limitations, and training.  Whether you're a digital professional, AI enthusiast, or an aspiring AI practitioner, this course equips you with the skills to craft effective prompts, generate high-quality responses, and interpret the outputs of the model. Through industry-relevant hands-on practice, you'll learn to harness ChatGPT's conversational AI capabilities to generate content, analyze data, and create nuanced AI tools.",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "PT3H",
    "Language": "en",
    "Skills": "ChatGPT Fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-design-thinking--cd12315",
    "Course Name": "Discovering Design Thinking Course",
    "Description": "Design Thinking is one of the most in-demand skills. In this course, we'll introduce you to the fundamental concepts that you'll need to step into the world of Design Thinking.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Design Thinking Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/business-analytics-fluency--cd11524",
    "Course Name": "Business Analytics Fluency Course",
    "Description": "In this course, you will learn fundamental topics of business analytics. You will learn how to use data to drive business decisions and solve business problems.",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "P1W",
    "Language": "en",
    "Skills": "Business Analytics Fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-ux-design--cd12314",
    "Course Name": "Discovering UX Design Course",
    "Description": "UX Design is one of the most in-demand skills. In this course, we'll introduce you to the fundamental concepts that you'll need to step into the world of UX Design.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "UX Design Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/site-reliability-engineer-nanodegree--nd087",
    "Course Name": "Site Reliability Engineer Nanodegree Program",
    "Description": "The goal of the Site Reliability Engineer (SRE) Nanodegree program is to equip software developers with the engineering and operational skills required to build automation tools and responses that ensure designed solutions respond to non-functional requirements such as availability, performance, security, and maintainability. The content will focus on both designing systems to automate response to issues with software sites as well as how to respond to common on-call situations.\n",
    "Level": "Intermediate",
    "Prerequisites": "Devops basics, Scripting, Amazon Elastic Kubernetes Service, Amazon elastic compute cloud, SQL queries, Basic computer programming, Kubernetes, Command line interface basics, Computer networking basics, AWS IAM",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Toil reduction, Data recovery, Site reliability engineering business context, Deployment automation, Terraform, Prometheus, Data replication, Service level objectives, Cloud availability, Disaster recovery plans, Reliability risk assessment, Feature launch reviews, Cloud capacity management, Rolling deployments, AWS autoscaling, It incident management, Deployment rollbacks, Canary deployment, On-call best practices, Feature design documents, Cloud autoscaling, Basic deployments, Kubernetes scaling, Tiered cloud capacity management, Blue-green deployment, Microservices architecture design, Cloud capacity planning, Self-healing system design, As-built documents, It incident postmortems, Cloud load balancing, Software load testing, Database backup automation, Database geo-replication, It asset inventories, Log shipping, Service level indicators, It asset consolidation, Service level metrics, Regional cloud asset deployment, Cloud asset deployment, Service level dashboards, Grafana, Application monitoring, Building site reliability engineering teams, Webhook alerts, Synthetic monitoring, Team SWOT analysis, Observability dashboards, Cost-benefit analysis, Site reliability metrics, Cross-functional collaboration, Site reliability engineering best practices",
    "Rating": 4.5
  },
  {
    "URL": "https://www.udacity.com/course/introduction-to-data-analytics-for-business--cd0022",
    "Course Name": "Introduction to Data Course",
    "Description": "Learn the basic concepts of data analysis and descriptive statistics. Learn how to manipulate, analyze and visualize data in Excel and Google Sheets. Learn about business metrics across a wide range of business areas (marketing, sales, growth and finance). Finally, learn about forecasting sales and financial metrics.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P1M",
    "Language": "en",
    "Skills": "Basic spreadsheet use, Business KPIs, Basic descriptive statistics, Spreadsheet functions, Quantitative data visualization, Forecast modeling in spreadsheets, Data visualization in spreadsheets, Professional presentations, Finance metrics, Marketing metrics, Data validation in spreadsheets, Pivot tables, Categorical data visualization, Inferential statistics, Chart types, Sales metrics, Growth metrics",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/data-science-for-business-leaders--nd045",
    "Course Name": "Data Science for Business Leaders Nanodegree Program",
    "Description": "Learn strategic, human capital, and technical requirements to deliver enhanced business outcomes and develop an organizational data science strategy. The course consists of four lessons that provide a broad introduction to data science and what it can do for a business, articulation of a business's strategic objectives, the human capital component of data science, and creating a data and data architecture strategy. The program also includes a capstone project where students prepare a 100-day data science plan for a company of their choosing.",
    "Level": "Beginner",
    "Prerequisites": "Basic probability, Basic descriptive statistics",
    "Duration": "P1M",
    "Language": "en",
    "Skills": "Data science strategy, Data science business context, Project risk mitigation, Data and data architecture strategy, Project evaluation, Building data science teams, Stakeholder management, Product management basics, Structured problem solving method, Data science use-cases",
    "Rating": 4.4
  },
  {
    "URL": "https://www.udacity.com/course/programming-for-data-science-nanodegree-with-R--nd118",
    "Course Name": "Programming for Data Science with R  Nanodegree Program",
    "Description": "This Programming for Data Science with R Nanodegree program provides an overview of data analysis and programming. In the SQL course, students learn to use SQL to answer complex business problems, including basic commands, joins, and aggregations. In the R course, students learn programming fundamentals and topics such as data types, functions, loops, and conditional statements. They learn to read and manipulate data in R, create basic visualizations, and perform statistical analysis. The version control course teaches students to use Git and GitHub to manage versions of programs and collaborate with others. These courses include practical projects where students use their skills to analyze real data.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "SQL aggregations, SQL joins, SQL queries, Control flow in r, SQL subqueries, SQL window functions, R data structures, R function definition, Data structures, R syntax, Ides",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/cloud-devops-using-microsoft-azure-nanodegree--nd082",
    "Course Name": "Cloud DevOps using Microsoft Azure Nanodegree Program",
    "Description": "This program teaches students how to deploy, test, and monitor cloud applications on Azure, thereby preparing learners for success on Microsoft’s AZ-400 DevOps Engineer Expert certification.",
    "Level": "Intermediate",
    "Prerequisites": "Scripting",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Software performance testing, Functional testing, Test environments, Logging, Cloud observability, Azure log analytics, Selenium, Integration testing, Infrastructure as code, Data validation, Azure monitor, CI/CD, Apache JMeter, Terraform, Postman, Test automation, Continuous improvement, Build automation, Trello, Agile methodologies, Pytest, Platform as a service, Continuous integration, Building agile teams, Azure app service, Root cause analysis, Project management, Github actions, Continuous deployment, Azure pipelines, Technical communication, Pylint, Gitops, Azure resource manager, Devops business context, Azure conditional access policies, Virtual machine management, Devops fluency, Azure user management, Azure active directory, Software project documentation, Cloud performance management, Azure CLI, Network security with Azure, Azure security center, Packer",
    "Rating": 4.3
  },
  {
    "URL": "https://www.udacity.com/course/ethical-hacker-nanodegree--nd350",
    "Course Name": "Ethical Hacker Nanodegree Program",
    "Description": "This program will equip students with the skills they need to advance in their security career and become an Ethical Hacker or Penetration Tester.",
    "Level": "Advanced",
    "Prerequisites": "Network security fundamentals, Command line interface basics, Computer networking basics, Client-server model, Basic Linux, Cloud computing proficiency, Cybersecurity fluency",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Report writing, Cybersecurity reconnaissance, Open-source intelligence, Owasp wstg, Digital footprint removal, Password attacks, Osint tools, Vulnerability management, Exploit code execution, Metasploit, Link analysis, Open source vulnerability database, Digital footprint analysis, SQL injection, Cybersecurity pivoting, Web hacking, Cherrytree, Backdoors, Passive cybersecurity reconnaissance, Vulnerability assessment, Social engineering, Phishing, Gophish, Security risk classification, Nessus, Security assessment, On-premise cyber attacks, Service enumeration, Advanced persistent threat, Steganography, Owasp zap, Active cybersecurity reconnaissance, Data exfiltration, Nmap, Dig, Router hacking, Privilege escalation, Traceroute, Dirb, Netdiscover, Red teaming, Port scanning, Nslookup, John the ripper, Wpscan, Cyber attack persistence, Keystroke logging, Port forwarding, Web application vulnerability scanning, Vulnerability exploitation, Cvss, Hash cat, Vulnerability scanning, Exploitdb, Veil-evasion, Burp suite, Google hacking, Cybersecurity ttps, SQLmap, Maltego, Malware development, Automated penetration testing, Semi-automated penetration testing, Exploratory data analysis, Nikto, Vulnerability research",
    "Rating": 4.1
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-programming-with-python-fluency--cd5227",
    "Course Name": "Programming with Python Fluency Course",
    "Description": "Learn basic programming with Python, one of the most versatile and widely used programming languages! This course will introduce you to core programming concepts and fundamental Python syntax by writing code to make a virtual \"turtle\" robot draw colorful shapes on the screen. ",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "P2W",
    "Language": "en",
    "Skills": "Python Fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/agile-fluency--cd1939",
    "Course Name": "Agile Fluency Course",
    "Description": "In this course, you will be introduced to The Agile Mindset and how it sets the tone for \"Being\" Agile versus just \"Doing\" Agile. You will learn to leverage The Agile Manifesto as the foundation for all Agile Frameworks, as well as identify the practical differences between Agile and Waterfall approaches. You will then take a deep dive into Agile Teams and Governance and apply best practices of both in order to deliver immense business value. By the end of this course, you will master characteristics of three of the more popular Agile Frameworks being utilized across all industries, which are Scrum, Kanban and XP, as well as apply The Agile Manifesto to deliver practical value in Agile teams and organizations.",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "P2W",
    "Language": "en",
    "Skills": "Agile fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/intro-to-data-science-fluency--cd1880",
    "Course Name": "Data Science Fluency Course",
    "Description": "Learn the data science process, including how to build effective data visualizations, and how to communicate with various stakeholders.",
    "Level": "Fluency",
    "Prerequisites": "",
    "Duration": "P1W",
    "Language": "en",
    "Skills": "Data science fluency",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-cybersecurity--cd2017",
    "Course Name": "Discovering Cybersecurity Course",
    "Description": "Get your start in the high-growth field of cybersecurity by learning the basic principles and concepts used to keep systems safe.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Cybersecurity awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/security-engineer-nanodegree--nd698",
    "Course Name": "Security Engineer Nanodegree Program",
    "Description": "You’ll master the foundational skills necessary to become a Security Engineer. This program will focus on how to protect a company’s computer systems, networks, applications and infrastructure.",
    "Level": "Intermediate",
    "Prerequisites": "Basic Linux, Computer networking basics, Windows operating system, Scripting",
    "Duration": "P4M",
    "Language": "en",
    "Skills": "Static application security testing, Software development lifecycle, Owasp top-10, Logging, Access management, Cybersecurity business context, Hashing, Cybersecurity risk management, It asset management, Vulnerability assessment, Cybersecurity strategy, Data encryption, Cvss, Owasp, Firewall configuration, Application security best practices, Vulnerability management, Security risk classification, Cybersecurity reconnaissance, Report writing, Cross-functional collaboration, Cybersecurity framework implementation, Microservices security, Security auditing, Security information and event management, Credential management, Adversarial simulation, Public key certificate management, Vulnerability scanning, Backup strategy, Golden images, Ipv6 security, Vulnerability patching, Firewalls, Network segmentation, VPN, Nmap, Network access control lists, Tcp/ip, Disaster recovery plans, Network monitoring, Multi-factor authentication, Security patch management, Cybersecurity standards fluency, Host-based idss, Yara rules, Cve, Server hardening strategy, Mandatory access control, Vulnerability exploitation, Operating system hardening, File integrity monitoring, Cybersecurity controls, Authentication, Cybersecurity fluency, Cybersecurity compliance, Cybersecurity resource fluency, Threat modeling, Cryptography, Fuzzing, Shift-left testing, Brute force attacks, Microsoft domain isolation policy design, Remote access management, Web application firewalls, Role-based access control, Wireshark, Perimeter security, Principle of least privilege, Virtual lan, Packet analysis, Access control models, Endpoint security, Threat mitigation, Cybersecurity segregation of duties, Chroot jails, Threat hunting, Intrusion detection systems, Advanced persistent threat, Osquery, Data security fundamentals, Cybersecurity advisories, Unix os hardening, Intrusion prevention, Security architecture fundamentals, Authorization, Cybersecurity grc, Cia triad, Non-repudiation, Public key certificates, Public key infrastructure",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/discovering-cloud-computing--cd2021",
    "Course Name": "Discovering Cloud Computing Course",
    "Description": "This course will give you the basic information you need to understand the fundamentals of cloud computing, including cloud services and cloud storage.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Cloud Computing Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/discovering-digital-project-management--cd2842",
    "Course Name": "Discovering Digital Project Management Course",
    "Description": "Digital Project Management is one of the most in-demand skills. In this lesson, we'll introduce you to the fundamental concepts that you'll need to step into the world of Digital Project Management.",
    "Level": "Discovery",
    "Prerequisites": "",
    "Duration": "PT1H",
    "Language": "en",
    "Skills": "Digital Project Management Awareness",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/generative-AI-for-business-leaders--cd13230",
    "Course Name": "Generative AI for Business Leaders Course",
    "Description": "Equip yourself to lead in the age of AI by understanding how to strategically implement generative AI within your business. This program provides practical insights into AI capabilities, limitations, and ethical considerations, helping you identify impactful use cases and make informed decisions about AI adoption. Learn to leverage AI tools to drive innovation, enhance customer experiences, and optimize operations while fostering a responsible AI approach that aligns with organizational goals and values.",
    "Level": "Intermediate",
    "Prerequisites": "Basic descriptive statistics",
    "Duration": "P3W",
    "Language": "en",
    "Skills": "Product management basics, Model performance metrics, GenAI Use Cases, Building AI Teams, AI business context, Product roadmaps, Machine learning system architectures, GenAI Models, Generative AI Fluency, GenAI Strategy",
    "Rating": "N/A"
  },
  {
    "URL": "https://www.udacity.com/course/cloud-native-application-architecture-nanodegree--nd064",
    "Course Name": "Cloud Native Application Architecture Nanodegree Program",
    "Description": "In this program, students will learn to run and manage scalable applications in a cloud native environment, using open source tools and projects like ArgoCD, gRPC, and Grafana.",
    "Level": "Intermediate",
    "Prerequisites": "Basic web development, Unix shell, Hashicorp vagrant, HTTP, Dockerhub, Python scripting, Basic Python, Containerization proficiency, Kubernetes, Git, API requests, Command line interface basics, Basic github",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Cloud observability, Stride framework, Microservices security, Refactoring from a monolith, Kubernetes security, Docker security, Cis benchmarks, Prometheus, Jaeger, Application tracing, Grafana, Message passing, Grpc, Cloud communication protocols, REST APIs, Cloud architecture model types, Kubernetes, Cloud computing fluency, Argo cd, Shift-left testing, Microservices hardening test plans, Image signing, Trivy, Runtime security monitoring, Kube-bench, Docker-bench, Nist nvd, Image layer analysis, Sysdig falco, Cybersecurity incident response playbooks, Owasp top-10, Grype, Software composition analysis, Application code vulnerabilities, Image hardening, Syft, Site reliability metrics, Observability dashboards, Message queues, Strangler pattern, Kafka basics, Cloud dependency maps, Cloud migration strategy, OpenAPI, Platform as a service, Cloud foundry, Template manifests, Helm, Github actions, CI/CD, Declarative manifests, Application development best practices, Docker",
    "Rating": 4.7
  },
  {
    "URL": "https://www.udacity.com/course/data-engineering-with-microsoft-azure-nanodegree--nd0277",
    "Course Name": "Data Engineering with Microsoft Azure Nanodegree Program",
    "Description": "Learn to design data models, build data warehouses, build data lakes and lakehouse architecture, create data pipelines, and work with large datasets on the Azure platform using Azure Synapse Analytics, Azure Databricks, and Azure Data Factory.",
    "Level": "Advanced",
    "Prerequisites": "Command line interface basics, Relational data models, Intermediate Python, Basic Python, Basic github, Intermediate SQL, Relational database basics, Azure basics, Basic SQL",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Database fundamentals, Cassandradb, PostgreSQL, Database normalization, Denormalized data schemas, Data modeling basics, Azure Data Factory, Data pipeline creation, Data pipeline maintenance, Azure pipelines, Data pipeline dags, Big data fluency, Databricks, Data lakes, Apache Spark, Data warehouse architecture, SQL databases in Azure, Infrastructure as code, Olap cubes, Azure Synapse Analytics, Cloud computing fluency, Data extraction, Azure blob storage, Azure portal, Star schemas",
    "Rating": 4.3
  },
  {
    "URL": "https://www.udacity.com/course/cloud-architect-using-microsoft-azure-nanodegree--nd090",
    "Course Name": "Cloud Architect using Microsoft Azure Nanodegree Program",
    "Description": "This program will teach you how to become an Azure Cloud Architect, build a migration plan to migrate from on-premises to the Azure Cloud, and apply automation, high availability, and backup/recovery skills to the role of an Azure Cloud Architect, Cloud Server Engineer, Azure Security Engineer, DevOps Engineer, and more.\n\n\n\n",
    "Level": "Advanced",
    "Prerequisites": "Azure compute service, Azure development, Computer networking basics, Cloud computing fluency, Azure networking services, Container orchestration, JSON, CI/CD, VPN, Virtual machine management, Azure CLI",
    "Duration": "P2M",
    "Language": "en",
    "Skills": "Cloud cost policies, Cloud cost evaluation, Automated cloud cost optimization, Azure security center, Azure key vault, Azure defender, Privileged identity management, Azure pricing calculator, Disaster recovery plans, Azure resource manager, Azure ad connect, Identity and access management fundamentals, Azure active directory, Multi-factor authentication, Distributed denial-of-service protection, Azure network watcher, Resource hardening with Azure, Data encryption, Zero trust security model, Database security, Azure sentinel, Azure bastion, Azure web application firewall, Azure conditional access policies, Azure smart alerts, Azure log analytics, Cloud resource provisioning, Azure insights, Cloud operational efficiency, Azure total cost of ownership calculator, Cloud availability, Azure load balancing services, Cloud blueprints, Azure site recovery, Azure blueprints, Cloud migration strategy, Azure virtual machine backup, Azure desired state configuration, Cloud design principles, Cloud migration, Azure migrate, Route based vpn, Cloud computing business context, Azure network security groups",
    "Rating": 4.8
  },
  {
    "URL": "https://www.udacity.com/course/digital-project-management-nanodegree--nd043",
    "Course Name": "Digital Project Management Nanodegree Program",
    "Description": "Digital Project Management enables the creation and development of online content, products, and services that help companies stay in business and grow. A digital project manager leverages digital tools to coordinate projects so they get done on time and within a budget, while satisfying the underlying needs of the business and its customers. The key skills you will learn from Digital Project Management Nanodegree include translating business requirements into a project scope statement, building project plans in Waterfall or Agile, and developing a high-performing team. The Digital Project Management Nanodegree teaches foundational concepts and common methods used today. It’s a fast-growing field that impacts a wide range of industries, including retail, media, and technology.",
    "Level": "Beginner",
    "Prerequisites": "",
    "Duration": "P1M",
    "Language": "en",
    "Skills": "Cost-benefit analysis, Project risk mitigation, Scrum, S.M.A.R.T. goals, Requirements gathering, Professional portfolios, Project execution, Project status reporting, Project scoping, Project closure, Project scheduling, Strategic communication plans, Project initiation, Business KPIs, Knowledge sharing, Gantt charts, Waterfall project management, Project monitoring and control, Stakeholder analysis, Project management artifacts, Scrum boards, Project management frameworks, Agile frameworks, The Tuckman ladder, Project planning, STARI stories, Sprint planning, Software development lifecycle, Team development, Raci matrices",
    "Rating": 5
  },
  {
    "URL": "https://www.udacity.com/course/growth-product-manager-nanodegree--nd037",
    "Course Name": "Growth Product Manager Nanodegree Program",
    "Description": "In this Nanodegree, you will learn to build acquisition funnels, identify core customers, and optimize growth loop models.",
    "Level": "Beginner",
    "Prerequisites": "Market segmentation, Product KPIs, Basic descriptive statistics, Professional presentations, Intermediate spreadsheet use, Interpreting test results",
    "Duration": "P3M",
    "Language": "en",
    "Skills": "Product monetization metrics, Product monetization strategy, Growth loops, Target personas, Premium value, Customer acquisition cost, Product monetization tactics, Product financial metrics, Product strategy, A/B testing, Cost per acquisition, Ux design principles, Product channel strategy, Growth metrics, Lifetime value, Customer retention tactics, Cohort analysis, Ux friction, Experiment design, Conversion rate, Activation metrics, User journey maps, Ice scoring model, Customer churn rate, Audience behavior tracking, User personas, Experiment metrics, Aarrr metrics framework, Growth bottlenecks, Ansoff matrix, Product strategy business context, Project evaluation",
    "Rating": 4.6
  }
]